Repository: amadev/incubator-superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ru

source: An error occurred while fetching dataset datasource values: %s
ru: Произошла ошибка при извлечении значений источника данных: %s

source: No annotation layers yet
ru: Нет слоев аннотаций

source: This action will permanently delete the layer.
ru: Это действие навсегда удалит слой.

source: Delete Layer?
ru: Удалить слой?

source: Are you sure you want to delete the selected layers?
ru: Вы уверены, что хотите удалить выбранные слои?

source: Please Confirm
ru: Пожалуйста подтвердите

source: Are you sure you want to delete
ru: Вы уверены, что хотите удалить

source: Last modified %s
ru: Изменено %s

source: The passwords for the databases below are needed in order to import them together with the charts. Please note that the "Secure Extra" and "Certificate" sections of the database configuration are not present in export files, and should be added manually after the import if they are needed.
ru: Пароли для БД необходимы для их импорта вместе с графиками. Пожалуйста, помните, что области конфигурации БД "Secure Extra" и "Certificate" отсутствуют в файлах экспорта и должны быть добавлены вручную после импорта в случае необходимости.

source: You are importing one or more charts that already exist. Overwriting might cause you to lose some of your work. Are you sure you want to overwrite?
ru: Вы загружаете один или несколько графиков, которые уже существуют. Перезаписать?

source: There was an issue deleting the selected charts: %s
ru: Возникла проблема при удалении выбранных графиков: %s

source: Modified By
ru: Изменено

source: Owner
ru: Владелец

source: An error occurred while fetching chart owners values: %s
ru: Произошла ошибка при получении данных владельцев графика: %s

source: An error occurred while fetching chart created by values: %s
ru: Произошла ошибка при извлечении графика, созданного значениями: %s

source: Viz Type
ru: Тип визуализации

source: An error occurred while fetching chart dataset values: %s
ru: Произошла ошибка при получении значений набора данных графика: %s

source: Are you sure you want to delete the selected charts?
ru: Вы уверены, что хотите удалить выбранные графики?

source: Edit CSS Template Properties
ru: Редактирование свойств шаблона CSS

source: css template name
ru: имя шаблона css

source: css templates
ru: Шаблоны CSS

source: There was an issue deleting the selected templates: %s
ru: Возникла проблема при удалении выбранных шаблонов: %s

source: Last modified by %s
ru: Изменено %s

source: Css Template
ru: Шаблон CSS

source: This action will permanently delete the template.
ru: Это действие окончательно удалит шаблон.

source: Delete Template?
ru: Удалить шаблоны CSS?

source: Are you sure you want to delete the selected templates?
ru: Вы уверены, что хотите удалить выбранные шаблоны?

source: The passwords for the databases below are needed in order to import them together with the dashboards. Please note that the "Secure Extra" and "Certificate" sections of the database configuration are not present in export files, and should be added manually after the import if they are needed.
ru: Пароли для БД необходимы для их импорта вместе с графиками. Пожалуйста, помните, что области конфигурации БД "Secure Extra" и "Certificate" отсутствуют в файлах экспорта и должны быть добавлены вручную после импорта в случае необходимости.

source: You are importing one or more dashboards that already exist. Overwriting might cause you to lose some of your work. Are you sure you want to overwrite?
ru: Вы загружаете один или несколько дашбордов, которые уже существуют. Перезаписать?

source: An error occurred while fetching dashboards: %s
ru: Произошла ошибка при извлечении дашбордов: %s

source: There was an issue deleting the selected dashboards:
ru: К сожалению, произошла ошибка при удалении выбранных дашбордов:

source: An error occurred while fetching dashboard owner values: %s
ru: Произошла ошибка при получении владельца дашборда: %s

source: An error occurred while fetching dashboard created by values: %s
ru: Произошла ошибка при получении данных дашборда: %s

source: Unpublished
ru: Не опубликован

source: Are you sure you want to delete the selected dashboards?
ru: Вы уверены, что хотите удалить выбранные дашборды?

source: Sorry, your browser does not support copying.
ru: Извините, Ваш браузер не поддерживание копирование. Используйте сочетание клавиш [CTRL + C] для WIN или [CMD + C] для MAC

source: SQL Copied!
ru: Копирование завершено

source: The passwords for the databases below are needed in order to import them. Please note that the "Secure Extra" and "Certificate" sections of the database configuration are not present in export files, and should be added manually after the import if they are needed.
ru: Пароли для БД необходимы для их импорта вместе с графиками. Пожалуйста, помните, что области конфигурации БД "Secure Extra" и "Certificate" отсутствуют в файлах экспорта и должны быть добавлены вручную после импорта в случае необходимости.

source: You are importing one or more databases that already exist. Overwriting might cause you to lose some of your work. Are you sure you want to overwrite?
ru: Вы загружаете одну или несколько БД, которые уже существуют. Перезаписать?

source: database
ru: База данных

source: An error occurred while fetching database related data: %s
ru: Произошла ошибка при извлечении данных из БД: %s

source: Asynchronous Query Execution
ru: Асинхронное выполнение запросов

source: Allow Data Manipulation Language
ru: Разрешить язык манипулирования данными

source: CSV Upload
ru: Загрузка CSV

source: Delete database
ru: Удалить базу данных

source: The database %s is linked to %s charts that appear on %s dashboards. Are you sure you want to continue? Deleting the database will break those objects.
ru: База данных %s связана с графиками %s в дашборде %s. Вы уверены, что хотите удалить?

source: Delete Database?
ru: Удалить базу данных?

source: Please enter a SQLAlchemy URI to test
ru: Введите SQLAlchemy URI для проверки

source: Connection looks good!
ru: Подключение прошло успешно!

source: ERROR: Connection failed.
ru: Ошибка: не удалось соединиться.

source: Connection
ru: Соединение

source: Database Name
ru: Название базы данных

source: Name your dataset
ru: Назовите набор данных

source: Refer to the
ru: Ссылка на

source: SQLAlchemy docs
ru: Документация SQLAlchemy

source: for more information on how to structure your URI.
ru: как структурировать URI.

source: Performance
ru: Быстродействие

source: SQL Lab Settings
ru: Настройки SQL

source: Allow users to run non-SELECT statements (UPDATE, DELETE, CREATE, ...)
ru: Позволяет пользователям запускать инструкции (UPDATE, DELETE, CREATE, …) без SELECT в редакторе SQL

source: When allowing CREATE TABLE AS option in SQL Lab, this option forces the table to be created in this schema.
ru: При разрешении опции CREATE TABLE AS в редакторе SQL эта опция создаст таблицу в выбранной схеме

source: JSON string containing additional connection configuration.
ru: JSON-строка, содержащая дополнительную конфигурацию соединения.

source: This is used to provide connection information for systems like Hive, Presto, and BigQuery, which do not conform to the username:password syntax normally used by SQLAlchemy.
ru: Используется для предоставления информации о соединении для систем Hive, Presto, BigQuery, которые не соответствуют синтаксису username:password, как в SQLAlchemy.

source: Root Certificate
ru: Корневой сертификат

source: Optional CA_BUNDLE contents to validate HTTPS requests. Only available on certain database engines.
ru: Необязательные содержание CA_BUNDLE для проверки HTTPS запросов. Доступно только в некоторых СУБД.

source: Impersonate Logged In User (Presto & Hive)
ru: Ассоциировать пользователя

source: If Presto, all the queries in SQL Lab are going to be executed as the currently logged on user who must have permission to run them. If Hive and hive.server2.enable.doAs is enabled, will run the queries as service account, but impersonate the currently logged on user via hive.server2.proxy.user property.
ru: Если вы используете Presto, все запросы в SQL-Редакторе будут выполняться от авторизованного пользователя, который должен иметь разрешение на их выполнение. <br/> Если включен Hive, то запросы будут выполняться через техническую учетную запись, но ассоциировать зарегистрированного пользователя можно через свойство hive.server2.proxy.user.

source: Allow Data Upload
ru: Разрешить загрузку данных

source: If selected, please set the schemas allowed for data upload in Extra.
ru: Если выбрано, пожалуйста, установите схемы, разрешенные для загрузки данных в Extra.

source: JSON string containing extra configuration elements.
ru: Строка JSON, содержащая дополнительные элементы конфигурации.

source: 1. The engine_params object gets unpacked into the sqlalchemy.create_engine call, while the metadata_params gets unpacked into the sqlalchemy.MetaData call.
ru: Объект engine_params распаковывается в sqlalchemy.create_engine, когда metadata_params распаковывается в sqlalchemy.MetaData.

source: 2. The metadata_cache_timeout is a cache timeout setting in seconds for metadata fetch of this database. Specify it as "metadata_cache_timeout": {"schema_cache_timeout": 600, "table_cache_timeout": 600}. If unset, cache will not be enabled for the functionality. A timeout of 0 indicates that the cache never expires.
ru: Параметр metadata_cache_timeout служит для ограничения времени на извлечение метаданных из БД. Установите значение параметра "metadata_cache_timeout": {"schema_cache_timeout": 600, "table_cache_timeout": 600}. Если не установлено, кэш будет не доступен. Таймаут=0 означает бессрочный кэш.

source: 3. The schemas_allowed_for_csv_upload is a comma separated list of schemas that CSVs are allowed to upload to. Specify it as "schemas_allowed_for_csv_upload": ["public", "csv_upload"]. If database flavor does not support schema or any schema is allowed to be accessed, just leave the list empty.
ru: schemas_allowed_for_csv_upload – это список схем, куда можно загружать файлы CSV. Определите параметр "schemas_allowed_for_csv_upload": ["public", "csv_upload"]. Если тип БД не поддерживает схему или ей разрешён доступ к любой схеме, оставьте поле пустым.

source: 4. The version field is a string specifying this db's version. This should be used with Presto DBs so that the syntax is correct.
ru: В поле версии вы можете указать версию БД. Чтобы синтаксис был правильным, используйте БД Presto.

source: 5. The allows_virtual_table_explore field is a boolean specifying whether or not the Explore button in SQL Lab results is shown.
ru: Поле allows_virtual_table_explore – это логическое значение, определяющее показ результатов по кнопке Explore в редакторе SQL.

source: Error while saving dataset: %s
ru: Ошибка при сохранении набора данных: %s

source: Add Dataset
ru: Добавить набор данных

source: The passwords for the databases below are needed in order to import them together with the datasets. Please note that the "Secure Extra" and "Certificate" sections of the database configuration are not present in export files, and should be added manually after the import if they are needed.
ru: Пароли для БД необходимы для их импорта вместе с графиками. Пожалуйста, помните, что области конфигурации БД "Secure Extra" и "Certificate" отсутствуют в файлах экспорта и должны быть добавлены вручную после импорта в случае необходимости.

source: You are importing one or more datasets that already exist. Overwriting might cause you to lose some of your work. Are you sure you want to overwrite?
ru: Вы загружаете один или несколько наборов данных, которые уже существуют. Перезаписать?

source: An error occurred while fetching dataset related data
ru: Произошла ошибка при получении данных из набора данных

source: An error occurred while fetching dataset related data: %s
ru: Произошла ошибка при получении данных из набора данных: %s

source: Physical Dataset
ru: Физический набор данных

source: Virtual Dataset
ru: Виртуальный набор данных

source: An error occurred while fetching dataset owner values: %s
ru: Произошла ошибка при извлечении значений владельца набора данных: %s

source: An error occurred while fetching datasets: %s
ru: Произошла ошибка при получении наборов данных: %s

source: An error occurred while fetching schema values: %s
ru: Произошла ошибка при загрузке значений схемы: %s

source: There was an issue deleting the selected datasets: %s
ru: Возникла проблема при удалении выбранных наборов данных: %s

source: The dataset %s is linked to %s charts that appear on %s dashboards. Are you sure you want to continue? Deleting the dataset will break those objects.
ru: Набор данных %s связан с графиками %s на отчете %s. Вы уверены, что хотите удалить?

source: Delete Dataset?
ru: Удалить набор данных?

source: Are you sure you want to delete the selected datasets?
ru: Вы уверены, что хотите удалить выбранные наборы данных?

source: 0 Selected
ru: 0 Выбрано

source: %s Selected (Virtual)
ru: %s Выбранных (Виртуальных)

source: %s Selected (Physical)
ru: %s Выбранных (Физических)

source: %s Selected (%s Physical, %s Virtual)
ru: %s Выбранных (%s Физических, %s Виртуальных)

source: There was an issue previewing the selected query. %s
ru: Возникла ошибка при предпросмотре выбранного запроса. %s

source: Success
ru: Успешно

source: Failed
ru: Не удалось

source: Running
ru: Выполнение

source: Offline
ru: Не в сети

source: Scheduled
ru: Запланировано

source: Duration: %s
ru: Продолжительность: %s

source: Tab Name
ru: Имя Таблицы

source: TABLES
ru: ТАБЛИЦЫ

source: Rows
ru: Строки

source: Open query in SQL Lab
ru: Открыть запрос в SQL редакторе

source: An error occurred while fetching database values: %s
ru: Произошла ошибка при загрузке значений базы данных: %s

source: Search by query text
ru: Поиск по тексту запроса

source: Query Preview
ru: Предпросмотр запросов

source: Previous
ru: Предыдущий

source: Next
ru: Следующий

source: Open in SQL Lab
ru: Открыть в SQL редакторе

source: User query
ru: Пользовательский запрос

source: Executed query
ru: Выполненный запрос

source: There was an issue previewing the selected query %s
ru: Возникла ошибка при предпросмотре выбранного запроса %s

source: Link Copied!
ru: Скопировано

source: There was an issue deleting the selected queries: %s
ru: Возникла ошибка при удалении выбранных запросов. %s

source: Query preview
ru: Предпросмотр данных

source: Edit query
ru: Редактировать запрос

source: Copy query URL
ru: Скопировать URL запроса

source: Delete query
ru: Удалить запрос

source: This action will permanently delete the saved query.
ru: Это действие безвозвратно удалит сохраненный запрос.

source: Delete Query?
ru: Удалить запрос?

source: Are you sure you want to delete the selected queries?
ru: Вы уверены, что хотите удалить выбранные запросы?

source: Query Name
ru: Имя запроса

source: Edited
ru: Отредактированные

source: Created
ru: Созданные

source: Viewed
ru: Просмотренные

source: Examples
ru: Примеры

source: Favorite
ru: Избранное

source: Mine
ru: Мои

source: View All
ru: Посмотреть все

source: Dashboard
ru: Дашборд

source: ) } yet
ru: ) } пока

source: Recently viewed charts, dashboards, and saved queries will appear here
ru: Недавно просмотренные графики, дашборды и сохраненные запросы будут здесь

source: Recently created charts, dashboards, and saved queries will appear here
ru: Недавно созданные графики, дашборды и сохраненные запросы будут здесь

source: Recent example charts, dashboards, and saved queries will appear here
ru: Недавние графики, дашборды и сохраненные запросы будут здесь

source: Recently edited charts, dashboards, and saved queries will appear here
ru: Недавно отредактированные графики, дашборды и сохраненные запросы будут здесь

source: SQL QUERY
ru: SQL запрос

source: You don't have any favorites yet!
ru: У вас ещё нет ничего избранного

source: SQL LAB QUERIES
ru: SQL LAB запросы

source: ${tableName}
ru: Имя Таблицы

source: query
ru: Запрос

source: SQL Query
ru: SQL Запрос

source: Last run %s
ru: Последний запуск %s

source: Recents
ru: Недавние

source: Select start and end date
ru: Выберите дату начала и окончания

source: Type or Select [%s]
ru: Выбрать или ввести [%s]

source: Filter Box
ru: Фильтр

source: Filters Configuration
ru: Настройки фильтров

source: Filter configuration for the filter box
ru: Конфигурация фильтра для бокса фильтра

source: Date Filter
ru: Временной фильтр

source: Whether to include a time filter
ru: Включить фильтр на определенный интервал/диапазон времени

source: Instant Filtering
ru: Мгновенная Фильтрация

source: Check to apply filters instantly as they change instead of displaying [Apply] button
ru: Проставьте галку, чтобы применить фильтр немедленно, поскольку они изменяют вместо отображения кнопки [Применить]

source: Show SQL Granularity Dropdown
ru: Показать детализацию SQL

source: Check to include SQL Granularity dropdown
ru: Установите флажок, чтобы включить меню детализации SQL

source: Show SQL Time Column
ru: Показать временной столбец SQL

source: Check to include Time Column dropdown
ru: Установите флажок, чтобы включить меню временного столбца

source: Show Druid Granularity Dropdown
ru: Показать меню детализации Druid

source: Check to include Druid Granularity dropdown
ru: Установите флажок, чтобы включить меню детализации Druid

source: Show Druid Time Origin
ru: Показать Druid Time Origin

source: Check to include Time Origin dropdown
ru: Установите флажок, чтобы включить меню Time Origin

source: Limit Selector Values
ru: Предельные значения селектора

source: These filters apply to the values available in the dropdowns
ru: Эти фильтры применяются к значениям в выпадающих меню

source: Time-series Table
ru: Таблица временных рядов

source: No dashboards yet
ru: Нет дашбордов

source: No saved queries yet
ru: Нет сохранённых запросов

source: No charts yet
ru: Нет графиков

source: See all
ru: Смотреть все

source: Custom Filters
ru: Конфигурация для запроса

source: Add one or more key:value pairs
ru: Добавьте пары ключ: значение

source: Add Filter
ru: Добавить значение

source: Custom Filter Creation
ru: Создание фильтра

source: Input filter key name
ru: Заполните значение ключа запроса

source: Input filter value
ru: Заполните значение
