Repository: amadev/incubator-superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ru

source: Details of the certification
ru: Информация о сертификации

source: Be careful.
ru: Осторожно.

source: Changing these settings will affect all charts using this dataset, including charts owned by other people.
ru: Изменение этих настроек повлияет на все графики, которые используют этот набор данных.

source: Source
ru: Источник

source: Sync columns from source
ru: Синхронизировать столбцы из источника

source: Calculated Columns
ru: Вычисленные столбцы

source: The dataset has been saved
ru: Набор данных сохранен

source: The dataset configuration exposed here affects all the charts using this dataset. Be mindful that changing settings here may affect other charts in undesirable ways.
ru: Конфигурация набора данных влияет на все графики данного набора данных.

source: Are you sure you want to save and apply changes?
ru: Вы уверены, что хотите сохранить и применить изменения?

source: Confirm save
ru: Подтвердить сохранение

source: Edit Dataset
ru: Редактировать набор данных

source: Use Legacy Datasource Editor
ru: Использование устаревшего редактора источников данных

source: Time Range
ru: Период времени

source: Time Column
ru: Столбец с датой

source: Time Grain
ru: Период времени

source: Origin
ru: Источник

source: Time Granularity
ru: Временной интервал

source: A reference to the [Time] configuration, taking granularity into account
ru: Ссылка на конфигурацию [Время] с учётом детализации

source: Group by
ru: Группировка

source: One or many controls to group by
ru: Выберите один или несколько controls to group by

source: One or many metrics to display
ru: Выберите один или несколько показателей для отображения

source: Dataset
ru: Набор данных

source: The type of visualization to display
ru: Выберите необходимый тип диаграммы

source: Fixed Color
ru: Цвет

source: Use this to define a static color for all circles
ru: Используйте это для определения цвета всех кругов

source: Right Axis Metric
ru: Показатель для правой оси

source: Choose a metric for right axis
ru: Выберите показатель для правой оси

source: Linear Color Scheme
ru: Цветовая Схема

source: Color Metric
ru: Цвет показателя

source: A metric to use for color
ru: Показатель, используемый для расчета цвета

source: One or many controls to pivot as columns
ru: Выберите один или несколько элементов управления для сведения в колонны

source: Defines the origin where time buckets start, accepts natural dates as in `now`, `Sunday` or `1970-01-01`
ru: Определяет начало периодов, принимает даты по типу `сейчас`, `воскресенье` или `1970-01-01`

source: The time granularity for the visualization. Note that you can type and use simple natural language as in `10 seconds`, `1 day` or `56 weeks`
ru: Интервал времени, в границах которого строится график. Обратите внимание, что для определения диапазона времени, вы можете использовать естественный язык. Например, можно указать словосочетания - «10 секунд», «1 день» или «56 недель»

source: The time column for the visualization. Note that you can define arbitrary expression that return a DATETIME column in the table. Also note that the filter below is applied against this column or expression
ru: Столбец данных с датой или временем. Обратите внимание, что вы можете определить произвольное выражение, которое возвращает столбец DATETIME в таблице. Также запомните, что фильтр ниже применяется к этому столбцу или выражению.

source: The time granularity for the visualization. This applies a date transformation to alter your time column and defines a new time granularity. The options here are defined on a per database engine basis in the Superset source code.
ru: Временная детализация. Применяется преобразование даты для изменения столбца времени и определяется новая степень детализации времени. Параметры здесь определены для каждого элемента СУБД в исходном коде Superset.

source: The time range for the visualization. All relative times, e.g. "Last month", "Last 7 days", "now", etc. are evaluated on the server using the server's local time (sans timezone). All tooltips and placeholder times are expressed in UTC (sans timezone). The timestamps are then evaluated by the database using the engine's local timezone. Note one can explicitly set the timezone per the ISO 8601 format if specifying either the start and/or end time.
ru: Временной диапазон визуализации. Все относительные времена – "В прошлом месяце", "За последние 7 дней", "сейчас" и т. д. – вычисляются на сервере с помощью локального времени (sans timezone). Все подсказки и заполнители выражаются в формате UTC (sans timezone). Временные метки вычисляются по БД с учётом локального времени. Обратите внимание, что можно явно установить часовой пояс в формате ISO 8601, если указать время начала и / или окончания. Обратите внимание, что можно установить часовой пояс по ISO 8601, если указать либо начальное, либо конечное время.

source: Series limit
ru: Лимит кол-ва рядов

source: Limits the number of time series that get displayed. A sub query (or an extra phase where sub queries are not supported) is applied to limit the number of time series that get fetched and displayed. This feature is useful when grouping by high cardinality dimension(s).
ru: Ограничивает количество отображаемых временных рядов. Подзапрос применяется для ограничения количества отображаемых и извлекаемых временных рядов. Функция полезна при группировке большого количества измерений.

source: Sort By
ru: Сортировка

source: Metric used to define the top series
ru: Показатель, используемый для определения, какие временные ряды будут отображаться при ограничении количества выводимых рядов

source: Series
ru: Ряды данных

source: Defines the grouping of entities. Each series is shown as a specific color on the chart and has a legend toggle
ru: Группировка в ряды данных. Каждый ряд отображается в виде определенного цвета и имеет легенду.

source: Entity
ru: Элемент

source: This defines the element to be plotted on the chart
ru: Элемент, который будет отражен на графике

source: X Axis
ru: Ось X

source: Metric assigned to the [X] axis
ru: Показатель, привязанный к оси X

source: Y Axis
ru: Ось Y

source: Metric assigned to the [Y] axis
ru: Показатель, привязанный к оси Y

source: Bubble Size
ru: Размер пузырька

source: Y Axis Format
ru: Формат Оси Y

source: When `Calculation type` is set to "Percentage change", the Y Axis Format is forced to `.1%`
ru: Когда тип вычислений установлен в 'Изменение процентов', формат оси Y `.1%`

source: The color scheme for rendering chart
ru: Цветовая схема для отрисовки диаграммы

source: Color Map
ru: Цветовая палитра

source: %s option(s)
ru: %s параметр(ы)

source: No such column found. To filter on a metric, try the Custom SQL tab.
ru: Такой столбец не найден. Для фильтрации по показателю, попробуйте Пользовательскую SQL-вкладку.

source: %s column(s) and metric(s)
ru: %s столбцов и показателей

source: %s column(s)
ru: столбцов: %s

source: To filter on a metric, use Custom SQL tab.
ru: Для фильтрации по показателям, используйте Пользовательскую SQL-вкладку.

source: %s operators(s)
ru: операторов: %s

source: type a value here
ru: введите значение здесь

source: Filter value (case sensitive)
ru: Значение фильтра (чувствительно к регистру)

source: choose WHERE or HAVING...
ru: выбрать WHERE или HAVING ...

source: filters by columns
ru: фильтр по столбцам

source: filters by metrics
ru: фильтр по показателям

source: This filter was inherited from the dashboard's context. It won't be saved when saving the chart.
ru: Данный фильтр был назначен из контекста дашборда. Он не будет сохранён при сохранении диаграммы.

source: %s aggregates(s)
ru: %s аггрегатов

source: description
ru: описание

source: bolt
ru: болт

source: Changing this control takes effect instantly
ru: Изменение этого элемента управления вступает в силу мгновенно

source: Customize
ru: Настройка

source: rows retrieved
ru: извлекаемых строк

source: Sorry, An error occurred
ru: К сожалению, произошла ошибка

source: No data
ru: Нет данных

source: View results
ru: Посмотреть результаты

source: View samples
ru: Посмотреть образцы

source: New chart
ru: Новый график

source: Edit properties
ru: Редактирование свойств

source: View query
ru: Посмотреть запрос

source: Run in SQL Lab
ru: Открыть в Редакторе SQL

source: Height
ru: Высота

source: Width
ru: Ширина

source: Export to .json
ru: Экспортировать в формат JSON

source: Export to .csv format
ru: Экспортировать в формат CSV

source: %s - untitled
ru: %s - без названия

source: Edit chart properties
ru: Редактирование свойств графика

source: Control labeled
ru: Помечено

source: You do not have permission to edit this chart
ru: У вас нет разрешения на редактирование этого графика

source: The description can be displayed as widget headers in the dashboard view. Supports markdown.
ru: Описание может отображаться в виде виджета заголовков в дашборде. Поддержка разметки.

source: Configuration
ru: Конфигурация

source: Duration (in seconds) of the caching timeout for this chart. Note this defaults to the dataset's timeout if undefined.
ru: Длительность (в секундах) таймаута кэша для этого графика.

source: A list of users who can alter the chart. Searchable by name or username.
ru: Владельцы - это список пользователей, которые могут изменять отчёт.

source: rows
ru: строки

source: Limit reached
ru: Достигнут предел

source: **Select** a dashboard OR **create** a new one
ru: ** Выбрать ** отчет ИЛИ ** ** создать новый

source: Please enter a chart name
ru: Введите имя графика

source: Save Chart
ru: Сохранить график

source: Save & go to dashboard
ru: Сохранить и перейти к дашборду

source: Save as new chart
ru: Сохранить как новый график

source: Save (Overwrite)
ru: Сохранить (Перезаписать)

source: Save as ...
ru: Сохранить как

source: Chart name
ru: Имя графика

source: Add to dashboard
ru: Добавить в дашборд

source: choose one or more columns or metrics
ru: выбрать один или несколько столбцов или показателей

source: Display configuration
ru: Показать конфигурацию

source: Configure your how you overlay is displayed here.
ru: Настроить ваш оверлей.

source: Style
ru: Стиль

source: Opacity
ru: Прозрачность

source: Color
ru: Цвет

source: Line Width
ru: Толщина линии

source: Layer Configuration
ru: Конфигурация слоя

source: Configure the basics of your Annotation Layer.
ru: Настройка основы для слоя аннотации.

source: Mandatory
ru: Обязательный

source: Hide Layer
ru: Скрыть слой

source: Choose the Annotation Layer Type
ru: Выбрать тип слоя аннотации

source: Annotation Layer Type
ru: Тип слоя аннотации

source: Remove
ru: Удалить

source: `Min` value should be numeric or empty
ru: Значение «Минимум» должно быть числовым или пустым

source: `Max` value should be numeric or empty
ru: Значение «Максимум» должно быть числовым или пустым

source: Min
ru: Минимум

source: Max
ru: Максимум

source: Edit Dataset
ru: Редактировать набор данных

source: Change Dataset
ru: Изменить набор данных

source: View in SQL Lab
ru: Открыть в SQL-редакторе

source: Expand/collapse dataset configuration
ru: Развернуть/свернуть конфигурацию набора данных

source: More dataset related options
ru: Другие опции для набора данных

source: Superset supports smart date parsing. Strings like `3 weeks ago`, `last sunday`, or `2 weeks from now` can be used.
ru: Superset поддерживает интеллектуальный анализ даты. Могут использоваться выражения типа `3 недели назад`, `в последнее воскресенье` или `через 2 недели`.

source: Default
ru: По умолчанию

source: (optional) default value for the filter, when using the multiple option, you can use a semicolon-delimited list of options.
ru: (опционально) значения по умолчанию для фильтра. При использовании нескольких параметров вы можете использовать список параметров, разделенных точкой с запятой

source: Sort Metric
ru: Сортировать показатели

source: Metric to sort the results by
ru: Показатель для сортировки результатов по

source: Sort Ascending
ru: Сортировка по возрастанию

source: Check for sorting ascending
ru: Проверить сортировку по возрастанию

source: Allow Multiple Selections
ru: Разрешить несколько вариантов

source: Multiple selections allowed, otherwise filter is limited to a single value
ru: Допускается несколько вариантов, в противном случае фильтр ограничивается одним значением

source: Search All Filter Options
ru: Поиск всех опций фильтра

source: By default, each filter loads at most 1000 choices at the initial page load. Check this box if you have more than 1000 filter values and want to enable dynamically searching that loads filter values as users type (may add stress to your database).
ru: По умолчанию фильтр загружает не более 1000 записей при первоначальной загрузке. Активируйте этот параметр, если у вас более 1000 значений фильтра, чтобы включить динамический поиск, который загружает значения фильтра по типу пользователя (может добавить нагрузки к вашей базе данных).

source: Required
ru: Необходимые

source: User must select a value for this filter
ru: Пользователь должен выбрать значение для этого фильтра

source: Filter Configuration
ru: Конфигурация фильтра

source: choose one or more columns or aggregate functions
ru: выбрать один или несколько столбцов или агрегирующие функции

source: choose a column or aggregate function
ru: выберите столбец или агрегирующие функцию

source: Error while fetching data
ru: Возникла ошибка при получении данных

source: No results found
ru: Записи не найдены

source: Invalid lat/long configuration.
ru: Неверная конфигурация широты/долготы.

source: Reverse lat/long
ru: Поменять местами широту/долготу

source: Longitude & Latitude columns
ru: Долгота и Широта

source: Delimited long & lat single column
ru: Широта и Долгота в одном столбце с разделителем

source: Multiple formats accepted, look the geopy.points Python library for more details
ru: Для уточнения форматов и получения более подробной информации, посмотрите Python-библиотеку geopy.points

source: Geohash
ru: Геохеш

source: textarea
ru: текстовая область

source: in modal
ru: в модальном

source: Time Series Columns
ru: Столбцы Временных Рядов

source: Click to change visualization type
ru: Выберите тип визуализации

source: This visualization type is not supported.
ru: Тип диаграммы не поддерживается

source: Select a visualization type
ru: Выберите тип визуализации

source: Failed to verify select options: %s
ru: Не удалось проверить выбранные параметры: %s

source: Code
ru: Редактор

source: Markup Type
ru: Тип Разметки

source: Pick your favorite markup language
ru: Выберите предпочитаемый язык разметки

source: Put your code here
ru: Введите произвольный текст в формате html или markdown

source: Query
ru: Запрос

source: URL
ru: Ссылка (URL)

source: Templated link, it's possible to include {{ metric }} or other values coming from the controls.
ru: Шаблонная ссылка, можно включить {{ metric }} или другие значения, поступающие из элементов управления.

source: Time
ru: Время

source: Time related form attributes
ru: В этом разделе можно установить параметры диаграммы, связанные с временем

source: Dataset & Chart Type
ru: Набор данных & Тип графика

source: Chart ID
ru: ID графика

source: The id of the active chart
ru: Идентификатор активного графика

source: Cache Timeout (seconds)
ru: Тайм-аут кэша (секунды)

source: The number of seconds before expiring the cache
ru: Количество секунд до истечения срока действия кэша

source: URL Parameters
ru: Параметры URL

source: Extra parameters for use in jinja templated queries
ru: Дополнительные параметры использования в шаблонных запросах jinja

source: Time range endpoints
ru: Конечные точки временного периода

source: Time range endpoints (SIP-15)
ru: Конечные точки временного периода (SIP-15)

source: Annotations and Layers
ru: Аннотации и слои

source: Sort Descending
ru: Сортировать по убыванию

source: Whether to sort descending or ascending
ru: Сортировка по убыванию или по возрастанию

source: Contribution
ru: Доля

source: Compute the contribution to the total
ru: Вычислить вклад в общую сумму (долю). Установите формат показателя в проценты.

source: Advanced Analytics
ru: Расширенный анализ

source: This section contains options that allow for advanced analytical post processing of query results
ru: В этом разделе содержатся параметры, которые позволяют производить аналитическую пост-обработку результатов запроса

source: Rolling Window
ru: Скользящее окно

source: Rolling Function
ru: Скользящая функция

source: Defines a rolling window function to apply, works along with the [Periods] text box
ru: Определяет размер плавающего окна наряду с текстовым полем [Periods].

source: Periods
ru: Периоды

source: Defines the size of the rolling window function, relative to the time granularity selected
ru: Определяет размер плавающего окна, относительно выбранной детализации по времени.

source: Min Periods
ru: Минимальные периоды

source: The minimum number of rolling periods required to show a value. For instance if you do a cumulative sum on 7 days you may want your "Min Period" to be 7, so that all data points shown are the total of 7 periods. This will hide the "ramp up" taking place over the first 7 periods
ru: Скрыть необходимое количество периодов. Например, если вы делаете накопительную сумму показателя за 7 дней, но хотите скрыть нарастающий итог за первые 6 дней, то указав в данном столбце «6», вы скроете нарастание, происходящее в течение первых 6 периодов.

source: Time Comparison
ru: Сравнение времени

source: Time Shift
ru: Временной сдвиг

source: Overlay one or more timeseries from a relative time period. Expects relative time deltas in natural language (example: 24 hours, 7 days, 52 weeks, 365 days). Free text is supported.
ru: Перекрыть один или более временных рядов из относительного временного периода. Поддерживает относительные периоды на естественном языке (например: 24 часа, 7 дней, 52 недели, 365 дней).

source: Calculation type
ru: Тип расчета

source: How to display time shifts: as individual lines; as the absolute difference between the main time series and each time shift; as the percentage change; or as the ratio between series and time shifts.
ru: Отображать временные сдвиги как: отдельные строки; абсолютная разница между основным временным рядом и любым временным сдвигом; процентное изменение; соотношение рядов и сдвигов.

source: Python Functions
ru: Функции Python

source: Rule
ru: Правило

source: Pandas resample rule
ru: Одна из функций (Resample) библиотеки Pandas, которая определяет период, к которому применяется функция агрегации.

source: Method
ru: Метод

source: Pandas resample method
ru: Метод частоты дискретизации pandas

source: Favorites
ru: Избранное

source: Created Content
ru: Созданный контент

source: Recent Activity
ru: Последние действия

source: Security & Access
ru: Безопасность и Доступ

source: No charts
ru: Нет графиков

source: No dashboards
ru: Нет дашбордов

source: No favorite charts yet, go click on stars!
ru: Нет избранных диаграмм. Нажмите звёздочку напротив названия необходимого графика, чтобы он появился в списке избранных диаграмм.

source: No favorite dashboards yet, go click on stars!
ru: Нет избранных дашбордов. Нажмите звёздочку напротив названия необходимого дашборда, чтобы он появился в списке избранного.

source: Profile picture provided by Gravatar
ru: Изображение профиля, сгенерированное сервисом Gravatar

source: joined
ru: присоединился

source: id:
ru: идентификатор:

source: There was an error fetching your recent activity:
ru: К сожалению, произошла ошибка:

source: Deleted: %s
ru: Удалено: %s

source: There was an issue deleting: %s
ru: Возникла проблема при удалении: %s

source: There was an issue deleting %s: %s
ru: Возникла проблема при удалении %s: %s

source: report
ru: отчет

source: alert
ru: оповещение

source: reports
ru: отчеты

source: alerts
ru: оповещения

source: There was an issue deleting the selected %s: %s
ru: К сожалению, произошла ошибка при удалении выбранного %s: %s

source: Notification Method
ru: Способ уведомления

source: Execution Log
ru: Журнал выполнения

source: Edit Alert
ru: Редактировать оповещение

source: Delete Alert
ru: Удалить оповещение

source: Actions
ru: Действия

source: Bulk Select
ru: Выбрать несколько

source: No %s yet
ru: Нет %s

source: Created By
ru: Создан

source: All
ru: Все

source: An error occurred while fetching created by values: %s
ru: Произошла ошибка при извлечении созданного по значениям: %s

source: Status
ru: Статус

source: Any
ru: Любые

source: Alerts & Reports
ru: Оповещения и отчеты

source: Reports
ru: Отчеты

source: This action will permanently delete %s.
ru: Это действие навсегда удалит %s

source: Delete %s?
ru: Удалить %s?

source: Please confirm
ru: Пожалуйста, подтвердите

source: Are you sure you want to delete the selected %s?
ru: Вы уверены, что хотите удалить %s?

source: < (Smaller than)
ru: <(Меньше)

source: > (Larger than)
ru: > (Больше)

source: <= (Smaller or equal)
ru: <= (Меньше или равно)

source: >= (Larger or equal)
ru: > = (Больше или равно)

source: == (Is Equal)
ru: == (равно)

source: != (Is Not Equal)
ru: ! = (Не равно)

source: Not Null
ru: Ненулевой

source: None
ru: Никто

source: 30 days
ru: 30 дней

source: 60 days
ru: 60 дней

source: 90 days
ru: 90 дней

source: Add notification method
ru: Добавить метод уведомления

source: Add delivery method
ru: Добавить способ доставки

source: Edit ${isReport ? 'Report' : 'Alert'}
ru: Редактировать ${isReport ? Отчёт' : 'Оповещение'}

source: Add ${isReport ? 'Report' : 'Alert'}
ru: Добавить ${isReport ? Отчёт' : 'Оповещение'}

source: Alert Name
ru: Имя оповещения

source: Alert Condition
ru: Условие оповещения

source: Alert If...
ru: Предупреждать, если ...

source: Value
ru: Значение

source: Alert Condition Schedule
ru: График состояния предупреждений

source: Schedule Settings
ru: Настройки расписания

source: Log Retention
ru: Срок хранения журнала

source: Working Timeout
ru: Таймаут работы

source: Time in seconds
ru: Время в секундах

source: Grace Period
ru: Период ожидания

source: Message Content
ru: Содержимое сообщения

source: log
ru: журнал

source: State
ru: Статус

source: Scheduled at
ru: Запланированное на

source: Start At
ru: Время начала

source: Duration
ru: Продолжительность

source: CRON Expression
ru: Выражение CRON

source: annotation
ru: аннотация

source: There was an issue deleting the selected annotations: %s
ru: Возникла проблема при удалении выбранных аннотаций: %s

source: Delete Annotation
ru: Удалить аннотацию

source: Annotation
ru: Аннотация

source: No annotation yet
ru: Нет аннотаций

source: Annotation Layer ${annotationLayerName}
ru: Слой аннотации ${annotationLayerName}

source: Are you sure you want to delete ${annotationCurrentlyDeleting?.short_descr}?
ru: Вы действительно хотите удалить ${annotationCurrentlyDeleting?.short_descr}?

source: Delete Annotation?
ru: Удалить аннотацию?

source: Are you sure you want to delete the selected annotations?
ru: Вы уверены, что хотите удалить выбранные аннотации?

source: annotation name
ru: Имя аннотации

source: date
ru: дата

source: Additional Information
ru: Дополнительная информация

source: Description (this can be seen in the list)
ru: Описание (это можно увидеть в списке)

source: json metadata
ru: метаданные json

source: annotation_layer
ru: слой аннотаций

source: Edit Annotation Layer Properties
ru: Редактирвовать свойства слоя аннотаций

source: annotation layer name
ru: Имя слоя аннотации

source: annotation layers
ru: Слои аннотации

source: There was an issue deleting the selected layers: %s
ru: Возникла проблема при удалении выбранных слоев: %s

source: Edit template
ru: Изменить шаблон

source: Delete template
ru: Удалить шаблон

source: Annotation Layer
ru: Слои аннотации
