Repository: amadev/incubator-superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ru

source: The query returned no data
ru: Запрос не вернул данных

source: Fetch data preview
ru: Получить данные для просмотра

source: Refetch Results
ru: Получить результаты

source: Track Job
ru: Отслеживать задачу

source: Run Selection
ru: Выполнить выбранное

source: Run
ru: Выполнить

source: Stop
ru: Стоп

source: Run query asynchronously (Ctrl + ↵)
ru: Выполнить асинхронный запрос (Ctrl + ↵)

source: Run query synchronously (Ctrl + ↵)
ru: Выполнить синхронный запрос (Ctrl + ↵)

source: Save & Explore
ru: Сохранить и посмотреть

source: Overwrite & Explore
ru: Перезаписать и посмотреть

source: Undefined
ru: Не определено

source: Label for your query
ru: Метка для вашего запроса

source: Write a description for your query
ru: Напишите описание к вашему запросу

source: Update
ru: Обновить

source: Save New
ru: Сохранить новый

source: Save
ru: Сохранить

source: Add
ru: Добавить

source: Save Query
ru: Сохранить запрос

source: Schedule Query
ru: Запланировать запрос

source: Schedule
ru: Расписание

source: Loading ...
ru: Идет загрузка…

source: Error
ru: Ошибка

source: Please save the query to enable sharing
ru: Пожалуйста, сохраните запрос для обеспечения обмена

source: Copy to clipboard
ru: Скопировать в буфер обмена

source: Share
ru: Поделиться

source: No stored results found; you need to re-run your query
ru: Не найдено сохраненных результатов, необходимо повторно запустить ваш запрос

source: Run a query to display results here
ru: Выполнить запрос и отобразить результаты

source: Preview: `%s`
ru: Предпросмотр: %s

source: Results
ru: Результаты

source: Run query
ru: Выполнить запрос

source: New tab
ru: Новая вкладка

source: Untitled Query
ru: Запрос без имени

source: Stop query
ru: Остановить запрос

source: Create table as with query results
ru: Создать таблицу на основе запроса

source: Create view as with query results
ru: Создать вид на основе результатов запроса

source: new table name
ru: новое название таблицы

source: It appears that the number of rows in the query results displayed was limited on the server side to the %s limit.
ru: Вероятно количество строк в результатах запроса было ограничено сервером до %s.

source: Schedule the query periodically
ru: Запланировать запрос периодически

source: You must run the query successfully first
ru: Сначала вы должны успешно выполнить запрос

source: Estimate the cost before running a query
ru: Оценка стоимости перед выполнением запроса

source: Keyboard shortcuts
ru: Горячие клавиши

source: Autocomplete
ru: Автозаполнение

source: Reset State
ru: Сбросить текущее состояние

source: Enter a new title for the tab
ru: Введите название для таблицы

source: Untitled Query %s
ru: Запрос без имени %s

source: Close tab
ru: Закрыть вкладку

source: Rename tab
ru: Переименовать вкладку

source: Expand tool bar
ru: Показать панель инструментов

source: Hide tool bar
ru: Скрыть панель инструментов

source: Close all other tabs
ru: Закрыть все остальные вкладки

source: Duplicate tab
ru: Дублировать вкладку

source: Copy partition query to clipboard
ru: Копировать запрос раздела в буфер обмена

source: latest partition:
ru: последний раздел:

source: Keys for table
ru: Ключевые поля таблицы

source: View keys & indexes (%s)
ru: Посмотреть ключи и индексы (%s)

source: Sort columns alphabetically
ru: Отсортировать столбцы в алфавитном порядке

source: Original table column order
ru: Расположение столбцов по умолчанию

source: Copy SELECT statement to the clipboard
ru: Скопировать выражение SELECT в буфер обмена

source: Show CREATE VIEW statement
ru: Показать выражение CREATE VIEW

source: CREATE VIEW statement
ru: Выражение CREATE VIEW

source: Remove table preview
ru: Убрать предпросмотр таблицы

source: Assign a set of parameters as
ru: Назначить набор параметров, как

source: below (example:
ru: ниже (например:

source: ), and they become available in your SQL (example:
ru: ), и они станут доступны в вашем SQL (например:

source: ) by using
ru: ) с помощью

source: Template Parameters
ru: Параметры шаблона

source: Edit template parameters
ru: Изменить параметры шаблона

source: Invalid JSON
ru: Недопустимый формат json

source: Create a new chart
ru: Создать новый график

source: Choose a dataset
ru: Выберите набор данных

source: If the dataset you are looking for is not available in the list, follow the instructions on how to add it in the Superset tutorial.
ru: Если нужного набора данных нет в списке, узнайте как добавить его в руководстве Superset.

source: Choose a visualization type
ru: Выберите тип диаграммы

source: Create new chart
ru: Создать новый график

source: An error occurred while loading the SQL
ru: Произошла ошибка при загрузке SQL

source: Updating chart was stopped
ru: Обновление графика остановлено

source: An error occurred while rendering the visualization: %s
ru: Произошла ошибка при построении диаграммы: %s

source: Network error.
ru: Ошибка сети.

source: every
ru: каждый

source: every month
ru: каждый месяц

source: every day of the month
ru: каждый день месяца

source: day of the month
ru: день месяца

source: every day of the week
ru: каждый день недели

source: day of the week
ru: день недели

source: every hour
ru: каждый час

source: every minute UTC
ru: каждая минута UTC

source: year
ru: год

source: month
ru: месяц

source: week
ru: неделя

source: day
ru: день

source: hour
ru: час

source: minute
ru: минута

source: reboot
ru: перезагрузить

source: Every
ru: Каждый

source: in
ru: в

source: on
ru: на

source: and
ru: и

source: at
ru: в

source: minute(s) UTC
ru: минут UTC

source: Invalid cron expression
ru: Неверное выражение cron

source: Clear
ru: Очистить

source: Sunday
ru: Воскресенье

source: Monday
ru: Понедельник

source: Tuesday
ru: Вторник

source: Wednesday
ru: Среда

source: Thursday
ru: Четверг

source: Friday
ru: Пятница

source: Saturday
ru: Суббота

source: January
ru: Январь

source: February
ru: Февраль

source: March
ru: Март

source: April
ru: Апрель

source: May
ru: Май

source: June
ru: Июнь

source: July
ru: Июль

source: August
ru: Август

source: September
ru: Сентябрь

source: October
ru: Октябрь

source: November
ru: Ноябрь

source: December
ru: Декабрь

source: SUN
ru: ВС

source: MON
ru: ПН

source: TUE
ru: ВТ

source: WED
ru: СР

source: THU
ru: ЧТ

source: FRI
ru: ПТ

source: SAT
ru: СБ

source: JAN
ru: Янв

source: FEB
ru: Фев

source: MAR
ru: Мар

source: APR
ru: Апр

source: MAY
ru: Май

source: JUN
ru: Июн

source: JUL
ru: Июл

source: AUG
ru: Авг

source: SEP
ru: Сен

source: OCT
ru: Окт

source: NOV
ru: Ноя

source: DEC
ru: Дек

source: Click to see difference
ru: Нажмите, чтобы увидеть различия

source: Altered
ru: Изменения

source: Chart changes
ru: Изменения графика

source: Superset Chart
ru: График Superset

source: Check out this chart in dashboard:
ru: Посмотреть этот график в дашборде:

source: Select ...
ru: Выбрать …

source: Loaded data cached
ru: Данные были загружены в кэш

source: Loaded from cache
ru: Загружено из кэша

source: Click to force-refresh
ru: Принудительное обновление

source: cached
ru: кэшировано

source: Certified by %s
ru: Сертифицировано %s

source: Sorry, your browser does not support copying. Use Ctrl / Cmd + C!
ru: Извините, ваш браузер не поддерживает копирование. Используйте сочетание клавиш [CTRL + C] для WIN или [CMD + C] для MAC

source: Copied!
ru: Копирование завершено

source: Error while fetching schema list
ru: Ошибка при получении списка схем

source: Error while fetching database list
ru: Ошибка при получении списка баз данных

source: Database:
ru: База данных:

source: Select a database
ru: Выберите базу данных

source: Force refresh schema list
ru: Принудительное обновление списка схем

source: Select a schema (%s)
ru: Выберите схему (%s)

source: Schema:
ru: Схема:

source: datasource
ru: Источник данных

source: schema
ru: Схема

source: delete
ru: Удалить

source: Type "%s" to confirm
ru: Введите "%s" чтобы подтвердить

source: DELETE
ru: УДАЛИТЬ

source: click to edit
ru: редактировать

source: You don't have the rights to alter this title.
ru: Недостаточно прав для изменения заголовка.

source: Unexpected error
ru: Непредвиденная ошибка

source: Click to favorite/unfavorite
ru: В избранное/убрать из избранного

source: An error occurred while fetching Dashboards
ru: Произошла ошибка при получении дашбордов

source: Run Query
ru: Выполнить запрос

source: Error while fetching table list
ru: Ошибка при получении списка таблиц

source: Select table or type table name
ru: Выберите таблицу или введите имя таблицы

source: Type to search ...
ru: Введите для поиска…

source: Select table
ru: Выберите таблицу

source: Force refresh table list
ru: Принудительное обновление списка таблиц

source: See table schema
ru: Посмотреть табличную схему

source: Share Dashboard
ru: Поделиться дашбордом

source: This may be triggered by:
ru: Это может быть вызвано:

source: Please reach out to the Chart Owner for assistance.
ru: Пожалуйста, обратитесь к владельцу графика за помощью.

source: Chart Owner: %s
ru: Владелец: %s

source: %s Error
ru: %s Ошибка

source: See More
ru: Больше

source: See Less
ru: Меньше

source: Copy Message
ru: Копировать сообщение

source: Close
ru: Закрыть

source: Unexpected Error
ru: Непредвиденная ошибка

source: We’re having trouble loading this visualization. Queries are set to timeout after %s second.
ru: Возникла проблема. Запрос прервался после %s секунд

source: We’re having trouble loading these results. Queries are set to timeout after %s second.
ru: Возникла проблема. Запрос прервался после %s секунд

source: Timeout Error
ru: Превышение лимита времени

source: Cell Content
ru: Содержимое ячейки

source: The import was successful
ru: Импорт произведен успешно

source: OVERWRITE
ru: ПЕРЕЗАПИСАТЬ

source: Overwrite
ru: Перезаписать

source: Import
ru: Импорт

source: Import %s
ru: Импорт %s

source: %s Selected
ru: %s Выбран

source: Deselect All
ru: Убрать выделение со всего

source: No Data
ru: Нет данных

source: %s-%s of %s
ru: %s-%s из %s

source: Settings
ru: Настройки

source: About
ru: О программе

source: There is not enough space for this component. Try decreasing its width, or increasing the destination width.
ru: Не достаточно места для этого компонента. Попробуйте уменьшить размер компонента либо увеличить размер конечной точки.

source: Cannot move top level tab into nested tabs
ru: Невозможно переместить вкладку верхнего уровня во вложенные вкладки

source: This chart has been moved to a different filter scope.
ru: Эта диаграмма была перемещена в другую область фильтра.

source: There was an issue fetching the favorite status of this dashboard.
ru: Произошла ошибка при получении статуса этого дашборда.

source: There was an issue favoriting this dashboard.
ru: Не удалось добавить этот дашборд в избранное.

source: This dashboard is now ${nowPublished}
ru: Этот дашборд ${nowPublished}

source: You do not have permissions to edit this dashboard.
ru: У вас нет разрешений на редактирование этого дашборда.

source: This dashboard was saved successfully.
ru: Дашборд успешно сохранен.

source: Could not fetch all saved charts
ru: Не удалось извлечь все сохраненные диаграммы

source: Sorry there was an error fetching saved charts:
ru: Произошла ошибка при извлечении сохраненных графиков:

source: Visualization
ru: Тип диаграммы

source: Data source
ru: Источник данных

source: Added
ru: Добавлено

source: Components
ru: Компоненты

source: Any color palette selected here will override the colors applied to this dashboard's individual charts
ru: Выбранные здесь цвета повлияют на цвета отдельных графиков в этом дашборде.

source: Color Scheme
ru: Цветовая схема

source: Load a template
ru: Загрузить шаблон

source: Load a CSS template
ru: Загрузить шаблон стилей (CSS)

source: Live CSS Editor
ru: Редактор CSS

source: You have unsaved changes.
ru: У вас есть несохраненные изменения.

source: This dashboard is currently force refreshing; the next force refresh will be in %s.
ru: Отчет принудительно обновляется; следующее принудительное обновление будет через %s.

source: Your dashboard is too large. Please reduce the size before save it.
ru: Отчет слишком большой. Пожалуйста, уменьшите его объём перед сохранением.

source: Discard Changes
ru: Отменить изменения

source: An error occurred while fetching available CSS templates
ru: Произошла ошибка при извлечении доступных шаблонов CSS

source: Superset Dashboard
ru: Отчёт Superset

source: Check out this dashboard:
ru: Просмотреть этот отчёт:

source: Save as
ru: Сохранить как

source: Share dashboard
ru: Поделиться дашбордом

source: Refresh dashboard
ru: Обновить дашборд

source: Set auto-refresh interval
ru: Установить интервал авто-обновления

source: Set filter mapping
ru: Установить распределение фильтров

source: Edit dashboard properties
ru: Редактировать свойства дашборда

source: Edit CSS
ru: Редактировать CSS

source: Download as image
ru: Скачать как изображение

source: Toggle FullScreen
ru: На весь экран

source: There is no chart definition associated with this component, could it have been deleted?
ru: Диаграммы, связанной с этим компонентом, не существует. Она была удалена?

source: Delete this container and save to remove this message.
ru: Удалить этот контейнер и сохранить, чтобы убрать это сообщение.

source: An error has occurred
ru: Произошла ошибка

source: You do not have permission to edit this dashboard
ru: Вы не имеете прав редактировать этот дашборд

source: A valid color scheme is required
ru: Требуется действительная цветовая схема

source: The dashboard has been saved
ru: Дашборд сохранен.

source: Apply
ru: Применить

source: Dashboard Properties
ru: Свойства дашборда

source: Basic Information
ru: Основная информация

source: URL Slug
ru: Строка URL

source: A readable URL for your dashboard
ru: Читаемый URL-адрес для дашборда

source: Access
ru: Доступ

source: Owners is a list of users who can alter the dashboard. Searchable by name or username.
ru: Владельцы - это список пользователей, которые могут изменять дашборд.

source: Colors
ru: Цвета

source: Advanced
ru: Дополнительно

source: This dashboard is not published, it will not show up in the list of dashboards. Click here to publish this dashboard.
ru: Дашборд не опубликован. Его не будет в общем списке дашбордов. Нажмите здесь, чтобы его опубликовать.

source: This dashboard is not published which means it will not show up in the list of dashboards. Favorite it to see it there or access it by using the URL directly.
ru: Дашборд не опубликован. Его не будет в общем списке дашбордов. Чтобы просмотреть дашборд, добавьте его в избранное или используйте URL.

source: This dashboard is published. Click to make it a draft.
ru: Этот дашборд опубликован. Щелкните, чтобы сделать его черновиком.

source: Draft
ru: Черновик

source: Don't refresh
ru: Не обновлять

source: 10 seconds
ru: 10 секунд

source: 30 seconds
ru: 30 секунд

source: 1 minute
ru: 1 минута

source: 5 minutes
ru: 5 минут

source: 30 minutes
ru: 30 минут

source: 1 hour
ru: 1 час

source: 6 hours
ru: 6 часов

source: 12 hours
ru: 12 часов

source: 24 hours
ru: 24 часа

source: Refresh Interval
ru: Интервал обновления

source: Refresh frequency
ru: Частота обновления

source: Are you sure you want to proceed?
ru: Вы уверены, что хотите продолжить?

source: Save for this session
ru: Сохранить в этой сессии

source: You must pick a name for the new dashboard
ru: Вы должны выбрать имя для нового дашборда

source: Save Dashboard
ru: Сохранить дашборд

source: Overwrite Dashboard [%s]
ru: Перезаписать дашборд [%s]

source: Save as:
ru: Сохранить как:

source: [dashboard name]
ru: [название дашборда]

source: also copy (duplicate) charts
ru: также копировать (дублировать) диаграммы

source: Filter your charts
ru: Фильтровать графики

source: Annotation layers are still loading.
ru: Слои аннотаций загружаются.

source: One or more annotation layers failed loading.
ru: Один или несколько слоев аннотации не удалось загрузить.

source: Cached %s
ru: Кэшировано %s

source: Fetched %s
ru: Извлечено %s

source: Minimize Chart
ru: Свернуть график

source: Maximize Chart
ru: Развернуть график

source: Force refresh
ru: Принудительное обновление

source: Toggle chart description
ru: Переключить описание графика

source: View Chart in Explore
ru: Просмотр диаграммы в Исследовать

source: Share chart
ru: Поделиться графиком

source: Export CSV
ru: Экспорт в CSV

source: Applied Filters (%d)
ru: Примененные фильтры (%d)

source: Incompatible Filters (%d)
ru: Несовместимые фильтры (%d)

source: Unset Filters (%d)
ru: Сбросить фильтры (%d)

source: Search...
ru: Поиск...

source: No filter is selected.
ru: Не выбран ни один фильтр.

source: Editing 1 filter:
ru: Редактирование 1 фильтра:

source: Batch editing %d filters:
ru: Множественное редактирование фильтров: %d

source: Configure filter scopes
ru: Настройка областей фильтра

source: There are no filters in this dashboard.
ru: В этом дашборде нет фильтров.

source: Expand all
ru: Расширить все

source: Collapse all
ru: Свернуть все

source: This markdown component has an error.
ru: Этот компонент разметки имеет ошибку.

source: This markdown component has an error. Please revert your recent changes.
ru: Этот компонент разметки имеет ошибку. Отмените последние изменения.

source: Delete dashboard tab?
ru: Удалить вкладку дашборда?

source: Divider
ru: Делитель

source: Header
ru: Строка заголовков

source: Row
ru: Строка

source: Tabs
ru: Вкладки

source: Preview
ru: Предпросмотр

source: All filters
ru: Все фильтры

source: All charts
ru: Все графики

source: Warning! Changing the dataset may break the chart if the metadata (columns/metrics) does not exist in the target dataset
ru: Осторожно! Изменение этого набора данных может повредить график, если метаданные (колонки/показатели) отсутствуют в целевом наборе данных.

source: Changing the dataset may break the chart if the chart relies on columns or metadata that does not exist in the target dataset
ru: Изменение набора данных может нарушить график, если он основан на несуществующих колонках или метаданных в целевом наборе данных

source: dataset
ru: Набор данных

source: Select a dataset
ru: Выберите набор данных

source: Warning!
ru: Предупреждение!

source: Search / Filter
ru: Поиск / Фильтр

source: Physical (table or view)
ru: Физическая (таблица или представление)

source: Virtual (SQL)
ru: Виртуальная (SQL)

source: Data Type
ru: Тип данных

source: The pattern of timestamp format. For strings use
ru: Шаблон временной метки. Для строк используйте

source: python datetime string pattern
ru: Строка шаблона Python DateTime

source: expression which needs to adhere to the
ru: выражение которое должно быть добавлено к

source: standard to ensure that the lexicographical ordering coincides with the chronological ordering. If the timestamp format does not adhere to the ISO 8601 standard you will need to define an expression and type for transforming the string into a date or timestamp. Note currently time zones are not supported. If time is stored in epoch format, put `epoch_s` or `epoch_ms`. If no pattern is specified we fall back to using the optional defaults on a per database/column name level via the extra parameter.
ru: стандарт, подтверждающий, что лексикографический порядок совпадает с хронологическим порядком. Если формат временной метки не совмещён со стандартом ISO 8601, вам необходимо преобразовать выражение и тип строки в формат даты или временной метки. Обратите внимание, что на данный момент временные зоны не поддерживаются Если время хранится в формате epoch, вводите `epoch_s` или `epoch_ms`. Если шаблон не настроен, вернитесь к использованию параметров по умолчанию на уровне имени базы данных/столбца с помощью дополнительного параметра.

source: Is Dimension
ru: Измерение

source: Is Temporal
ru: Содержит дату /время

source: Is Filterable
ru: Фильтрующийся

source: Modified columns: %s
ru: Измененные столбцы: %s

source: Removed columns: %s
ru: Удаленные столбцы: %s

source: New columns added: %s
ru: Добавлены новые столбцы: %s

source: Metadata has been synced
ru: Метаданные синхронизированы

source: Column name [%s] is duplicated
ru: Название столбца [%s] скопировано

source: Metric name [%s] is duplicated
ru: Название метрики [%s] скопировано

source: Calculated column [%s] requires an expression
ru: Вычисляемые столбцы [%s] требуют выражения

source: Basic
ru: Основной

source: Default URL
ru: URL по умолчанию

source: Default URL to redirect to when accessing from the dataset list page
ru: URL по умолчанию служит для перенаправления при обращении со страницы со списком набора данных

source: Autocomplete filters
ru: Автозаполнение фильтров

source: Whether to populate autocomplete filters options
ru: Следует ли включать параметры фильтров автозаполнения

source: Autocomplete Query Predicate
ru: Автозаполнение условий запроса

source: When using "Autocomplete filters", this can be used to improve performance of the query fetching the values. Use this option to apply a predicate (WHERE clause) to the query selecting the distinct values from the table. Typically, the intent would be to limit the scan by applying a relative time filter on a partitioned or indexed time-related field.
ru: Включение автозаполнения фильтров может улучшить производительность запросов. Используйте эту функцию, чтобы применить к запросу логическое выражение (WHERE) для выбора определённых значений из таблицы. Обычно суть заключается в ограничении сканирования путем применения фильтра относительного времени к разделенному или индексированному временному полю.

source: Extra data to specify table metadata. Currently supports certification data of the format: `{ "certification": { "certified_by": "Data Platform Team", "details": "This table is the source of truth." } }`.
ru: Дополнительные данные для определения метаданных таблицы. На данный момент поддерживаются данные формата: `{ "certification": { "certified_by": "Data Platform Team", "details": "This table is the source of truth." } }`.

source: Owners of the dataset
ru: Владельцы набора данных

source: The duration of time in seconds before the cache is invalidated
ru: Количество секунд до истечения срока действия кэша

source: Hours offset
ru: Часовой сдвиг

source: Spatial
ru: пространственная

source: virtual
ru: виртуальный

source: dataset name
ru: название источника данных

source: When specifying SQL, the datasource acts as a view. Superset will use this statement as a subquery while grouping and filtering on the generated parent queries.
ru: Если указан SQL, источник данных работает как режим представления. Superset будет использовать данное выражение в качестве подзапроса при группировке и фильтрации родительских запросов.

source: The JSON metric or post aggregation definition.
ru: Показатели JSON

source: Physical
ru: Физический

source: The pointer to a physical table (or view). Keep in mind that the chart is associated to this Superset logical table, and this logical table points the physical table referenced here.
ru: Указатель на физическую таблицу (режим представления). Помните, что график связан с логической таблицей в Superset, и она указывает на связанную физическую таблицу

source: Click the lock to make changes.
ru: Нажмите на замок, чтобы внести изменения.

source: Click the lock to prevent further changes.
ru: Нажмите на замок, чтобы предотвратить будущие изменения.

source: Warning message to display in the metric selector
ru: Предупреждающее сообщение для отображения в селекторе показателя

source: Certified By
ru: Сертифицировано

source: Person or group that has certified this metric
ru: Лицо или группа, которая сертифицировала этот показатель

source: Certification Details
ru: Детали сертификата
