Repository: amadev/incubator-superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ru

source: Home
ru: Главная

source: Annotation Layers
ru: Слои аннотаций

source: Manage
ru: Управление

source: Databases
ru: Базы данных

source: Data
ru: Данные

source: Datasets
ru: Наборы данных

source: Charts
ru: Графики

source: Dashboards
ru: Дашборды

source: CSS Templates
ru: Шаблоны CSS

source: Row level security
ru: Безопасность на уровне строк

source: Security
ru: Безопасность

source: Import Dashboards
ru: Импорт дашбордов

source: SQL Editor
ru: Редактор SQL

source: SQL Lab
ru: Лаборатория

source: Saved Queries
ru: Сохраненные запросы

source: Query History
ru: История запросов

source: Upload a CSV
ru: Загрузить CSV

source: Upload Excel
ru: Загрузить Excel

source: Action Log
ru: Журнал Действий

source: Dashboard Emails
ru: Рассылки дашбордов

source: Chart Email Schedules
ru: Расписание рассылки графиков

source: Alerts
ru: Оповещения

source: Access requests
ru: Запросы доступа

source: Druid Datasources
ru: Источники Данных Druid

source: Druid Clusters
ru: Список Кластеров Druid

source: Scan New Datasources
ru: Сканирование Новых Источников Данных

source: Refresh Druid Metadata
ru: Обновить Метаданные Druid

source: Issue 1000 - The datasource is too large to query.
ru: Ошибка 1000 - Источник данных слишком велик для запроса.

source: Issue 1001 - The database is under an unusual load.
ru: Ошибка 1001 - база данных находится под необычной нагрузкой.

source: Issue 1002 - The database returned an unexpected error.
ru: Ошибка 1002 - База данных сообщила о непредвиденной ошибке.

source: Issue 1003 - There is a syntax error in the SQL query. Perhaps there was a misspelling or a typo.
ru: Ошибка 1003 - Ошибка синтаксиса в запросе SQL. Возможно, там была опечатка.

source: Issue 1004 - The column was deleted or renamed in the database.
ru: Ошибка 1004 - Колонка была удалена или переименована в базе данных.

source: Issue 1005 - The table was deleted or renamed in the database.
ru: Ошибка 1005 - Таблица был удалена или переименована в базе данных.

source: Issue 1006 - One or more parameters specified in the query are missing.
ru: Ошибка 1006 - Один или несколько параметров, указанных в запросе, отсутствуют.

source: Invalid certificate
ru: Неверный сертификат

source: Unsafe return type for function %(func)s: %(value_type)s
ru: Небезопасный тип возвращаемого знаечения для функции %(func)s: %(value_type)s

source: Unsupported return value for method %(name)s
ru: Возвращаемое значение для метода %(name)s не поддерживается

source: Unsafe template value for key %(key)s: %(value_type)s
ru: Небезопасное значение шаблона для ключа %(key)s: %(value_type)s

source: Unsupported template value for key %(key)s
ru: Неподдерживаемое значение шаблона для ключа %(key)s

source: Only `SELECT` statements are allowed against this database
ru: Только выражения `SELECT` допускаются к этой базе данных

source: Only `SELECT` statements can be used with the CREATE TABLE feature.
ru: Только выражения `SELECT` могут использоваться с функцией CREATE TABLE.

source: Viz is missing a datasource
ru: У визуализации отсутствует источник данных

source: Applied rolling window did not return any data. Please make sure the source query satisfies the minimum periods defined in the rolling window.
ru: Примененное скользящее окно не вернуло данных. Проверьте диапазоны дат.

source: From date cannot be larger than to date
ru: Невозможно выбрать дату [from], которая позже текущего дня

source: Cached value not found
ru: Сохраненное значение не найдено

source: Columns missing in datasource: %(invalid_columns)s
ru: Столбцы отсутствуют в источнике данных: %(invalid_columns)s

source: Table View
ru: Табличный вид

source: You cannot use [Columns] in combination with [Group By]/[Metrics]/[Percentage Metrics]. Please choose one or the other.
ru: Вы не можете использовать [Столбцы] в сочетании с [Группировать по] / [Показателям] / [Процентным показателям]. Пожалуйста, выберите один из вариантов.

source: Pick a granularity in the Time section or uncheck 'Include Time'
ru: Выберите столбец с датой и необходимый период в секции «Время» или снимите флажок «Включая дату»

source: Time Table View
ru: Вид Time Table

source: Pick at least one metric
ru: Выберите хотя бы одно значение

source: When using 'Group By' you are limited to use a single metric
ru: При использовании поля [Группировка] вы можете использовать только одно значение

source: Pivot Table
ru: Сводная таблица

source: Please choose at least one 'Group by' field
ru: Выберите хотя бы одно поле [Группировка]

source: Please choose at least one metric
ru: Пожалуйста, выберите хотя бы одно значение

source: Group By' and 'Columns' can't overlap
ru: Поля [Группировка] и [Столбцы] не могут пересекаться

source: Treemap
ru: Дерево

source: Calendar Heatmap
ru: Календарь Heatmap

source: Bubble Chart
ru: Пузырьковая диаграмма

source: Please use 3 different metric labels
ru: Пожалуйста, используйте 3 различных метки значения

source: Pick a metric for x, y and size
ru: Выберите значения для X, Y и размер

source: Bullet Chart
ru: Маркированный график

source: Pick a metric to display
ru: Выберите показатель для отображения

source: Big Number with Trendline
ru: Большое число с Trendline

source: Pick a metric!
ru: Выберите показатель!

source: Big Number
ru: Большое число

source: Time Series - Line Chart
ru: Временные ряды - линейный график

source: Pick a time granularity for your time series
ru: Выберите период для временных рядов

source: An enclosed time range (both start and end) must be specified when using a Time Comparison.
ru: Закрытый временной диапазон (начало и конец) должен быть определен при использовании Временного сравнения.

source: Time Series - Multiple Line Charts
ru: Временные ряды - Многолинейные диаграммы

source: Time Series - Dual Axis Line Chart
ru: Временные ряды - Двухосная линейная диаграмма

source: Pick a metric for left axis!
ru: Выберите значение для левой оси!

source: Pick a metric for right axis!
ru: Выберите значение для правой оси!

source: Please choose different metrics on left and right axis
ru: Пожалуйста, выберите разные значения данных для левой и правой оси

source: Time Series - Bar Chart
ru: Временные ряды – Столбиковая диаграмма

source: Time Series - Period Pivot
ru: Временные ряды – Сводный периодический график

source: Time Series - Percent Change
ru: Временные ряды - Процентное изменение

source: Time Series - Stacked
ru: Временные ряды – Столбчатая диаграмма с накоплением

source: Histogram
ru: Гистограмма

source: Must have at least one numeric column specified
ru: Должен быть указан хотя бы один числовой столбец

source: Distribution - Bar Chart
ru: Распределение - Столбиковая диаграмма

source: Can't have overlap between Series and Breakdowns
ru: Значения в полях [Столбцы данных] и [Ряды данных] должны быть разными

source: Pick at least one field for [Series]
ru: Выберите хотя бы одно значение для поля [Столбцы данных]

source: Sunburst
ru: Лучевая диаграмма

source: Sankey
ru: Диаграмма Санкей

source: Pick exactly 2 columns as [Source / Target]
ru: Выберите ровно два столбца в поле [Источник / Назначение]

source: There's a loop in your Sankey, please provide a tree. Here's a faulty link: {}
ru: В вашей диаграмме Санкей образовалась петля. Пожалуйста, создайте дерево. Ошибочное звено:

source: Directed Force Layout
ru: Компоновка Directed Force

source: Pick exactly 2 columns to 'Group By'
ru: Выберите ровно два столбца в поле [Группировка]

source: Country Map
ru: Карта Стран

source: World Map
ru: Карта Мира

source: Filters
ru: Фильтры

source: Invalid filter configuration, please select a column
ru: Неверная конфигурация фильтра, пожалуйста, выберите столбец

source: Parallel Coordinates
ru: Параллельные координаты

source: Heatmap
ru: Тепловая карта

source: Horizon Charts
ru: Горизонтальная диаграмма

source: Mapbox
ru: Интерактивная карта

source: [Longitude] and [Latitude] must be set
ru: Столбцы [Долгота] и [Широта] должны присутствовать

source: Must have a [Group By] column to have 'count' as the [Label]
ru: Должен иметь столбец [Группировка], чтобы был «счетчик» в качестве [Метка]

source: Choice of [Label] must be present in [Group By]
ru: Выбор [Метка] должны присутствовать в поле [Группировка]

source: Choice of [Point Radius] must be present in [Group By]
ru: Выбор [Радиуса точки] должен присутствовать в поле [Группировка]

source: [Longitude] and [Latitude] columns must be present in [Group By]
ru: Столбцы [Долгота] и [Широта] должны присутствовать в поле [Группировка]

source: Deck.gl - Multiple Layers
ru: Deck.gl - Многослойность

source: Bad spatial key
ru: Плохой пространственный ключ

source: Invalid spatial point encountered: %s
ru: Неверная пространственная точка: %s

source: Encountered invalid NULL spatial entry, please consider filtering those out
ru: Нулевая пространственная запись, возможно стоит отфильтровать

source: Deck.gl - Scatter plot
ru: Deck.gl - Диаграмма рассеяния

source: Deck.gl - Screen Grid
ru: Deck.gl - Экранная сетка

source: Deck.gl - 3D Grid
ru: Deck.gl - 3D Сетка

source: Deck.gl - Paths
ru: Deck.gl - Пути

source: Deck.gl - Polygon
ru: Deck.gl - Полигон

source: Deck.gl - Arc
ru: Deck.gl - Дуга

source: Event flow
ru: Поток событий

source: Time Series - Paired t-test
ru: Временные ряды - t-критерий Стьюдента

source: Time Series - Nightingale Rose Chart
ru: Временные ряды – Диаграмма Nightingale Rose

source: Partition Diagram
ru: Разделённая диаграмма

source: Choose either fields to [Group By] and [Metrics] and/or [Percentage Metrics], or [Columns], not both
ru: Выберите либо поля [Группировать по] и [Значения] и/или [Процентные значения], или [Столбцы]

source: Box Plot
ru: Блочная диаграмма

source: Distribution - NVD3 - Pie Chart
ru: Распределение - NVD3 - Круговая диаграмма

source: iFrame
ru: Плавающий фрейм

source: Deleted %(num)d annotation layer
ru: Удалено слоев аннотации %(num)d

source: All Text
ru: Весь текст

source: Deleted %(num)d annotation
ru: Удалено аннотаций %(num)d

source: End date must be after start date
ru: Невозможно выбрать дату

source: Short description must be unique for this layer
ru: Краткое описание должно быть уникальным для этого слоя

source: Annotations could not be deleted.
ru: Аннотации не могут быть удалены.

source: Annotation not found.
ru: Аннотация не найдена

source: Annotation parameters are invalid.
ru: Неверные параметры аннотации.

source: Annotation could not be created.
ru: Аннотация не может быть создана

source: Annotation could not be updated.
ru: Аннотация не может быть обновлена

source: Annotation delete failed.
ru: Ошибка удаления аннотации

source: Annotation layer parameters are invalid.
ru: Неверные параметры слоя аннотации.

source: Annotation layer could not be deleted.
ru: Слой аннотации не может быть удален.

source: Annotation layer could not be created.
ru: Ваш запрос не может быть сохранен

source: Annotation layer could not be updated.
ru: Аннотация не может быть обновлена

source: Annotation layer not found.
ru: Слой аннотации не найден.

source: Annotation layer delete failed.
ru: Ошибка удаления слоя аннотаций.

source: Annotation layer has associated annotations.
ru: Слой аннотаций имеет ассоциированные аннотации.

source: Name must be unique
ru: Имя должно быть уникальным

source: Deleted %(num)d chart
ru: Удалено графиков %(num)d

source: Request is incorrect: %(error)s
ru: Неверный запрос: %(error)s

source: `confidence_interval` must be between 0 and 1 (exclusive)
ru: `Confidence_interval` должен находиться в диапазоне от 0 до 1 (Exclusive)

source: lower percentile must be greater than 0 and less than 100. Must be lower than upper percentile.
ru: Нижний процентиль должен быть больше 0 и меньше 100. Должен быть ниже верхнего процентиля.

source: upper percentile must be greater than 0 and less than 100. Must be higher than lower percentile.
ru: Верхний процентиль должен быть больше, чем 0, и меньше, чем 100. Должен быть выше, чем нижний процентиль.

source: `width` must be greater or equal to 0
ru: `Width` должно быть больше или равно 0

source: `row_limit` must be greater than or equal to 1
ru: `Row_limit` должно быть больше или равно 1,

source: `row_offset` must be greater than or equal to 0
ru: `Row_offset` должно быть больше или равно 0

source: There are associated alerts or reports: %s,
ru: Связанные оповещения или сообщения: %s,

source: Database does not exist
ru: База данных не существует

source: Dashboards do not exist
ru: Дашборды не существуют

source: Datasource type is required when datasource_id is given
ru: Требуется тип источника данных, если есть id источника данных

source: Chart parameters are invalid.
ru: Неверные параметры графика

source: Chart could not be created.
ru: График не может быть сохранен

source: Chart could not be updated.
ru: График не может быть обновлён

source: Chart could not be deleted.
ru: График не может быть удален.

source: There are associated alerts or reports
ru: Есть сопутствующие предупреждения или сообщения

source: Changing this chart is forbidden
ru: Изменение этого графика запрещено

source: Charts could not be deleted.
ru: Графики не могут быть удалены.

source: Import chart failed for an unknown reason
ru: Импорт диаграммы не удался по неизвестным причинам

source: Owners are invalid
ru: Владельцы недействительны

source: Datasource does not exist
ru: Источника данных не существует

source: `operation` property of post processing object undefined
ru: Свойство объекта `Operation` после обработки не определено

source: Unsupported post processing operation: %(operation)s
ru: Неподдерживаемая операция постобработки: %(operation)s

source: Adding new datasource [{}]
ru: Добавление нового источника данных [{}]

source: Refreshing datasource [{}]
ru: Обновление источника данных [{}]

source: Metric(s) {} must be aggregations.
ru: Показатели {} должны быть сгруппированы.

source: Unsupported extraction function:
ru: Неподдерживаемая функция извлечения:

source: Columns
ru: Столбцы

source: Show Druid Column
ru: Показать колонку Druid

source: Add Druid Column
ru: Добавить колонку Druid

source: Edit Druid Column
ru: Редактировать колонку Druid

source: Column
ru: Колонка

source: Type
ru: Тип

source: Datasource
ru: Источник данных

source: Groupable
ru: Группируемый

source: Filterable
ru: Фильтрующийся

source: Whether this column is exposed in the `Filters` section of the explore view.
ru: Необходимо отметить, если столбец должен быть доступен в разделе «Фильтры».

source: Metrics
ru: Показатели

source: Show Druid Metric
ru: Показать метрику Druid

source: Add Druid Metric
ru: Добавить метрику Druid

source: Edit Druid Metric
ru: Редактировать метрику Druid

source: Metric
ru: Показатель

source: Description
ru: Описание

source: Verbose Name
ru: Полное имя

source: Druid Datasource
ru: Источники Данных Druid

source: Warning Message
ru: Предупреждающее сообщение

source: Show Druid Cluster
ru: Показать Кластер Druid

source: Add Druid Cluster
ru: Добавить Кластер Druid

source: Edit Druid Cluster
ru: Редактировать Кластер Druid

source: Cluster Name
ru: Имя кластера

source: Broker Host
ru: Брокер-Хост

source: Broker Port
ru: Порт брокера

source: Broker Username
ru: Пользователь брокера

source: Broker Password
ru: Пароль брокера

source: Broker Endpoint
ru: URL брокера

source: Cache Timeout
ru: Тайм-аут Кэша

source: Metadata Last Refreshed
ru: Последнее обновление метаданных

source: Duration (in seconds) of the caching timeout for this cluster. A timeout of 0 indicates that the cache never expires. Note this defaults to the global timeout if undefined.
ru: Длительность (в секундах) таймаута кэша для данного кластера. Таймаут, равный 0, - кеш не удаляется. Это стандартное глобальное значение, если не определено другое

source: Druid supports basic authentication. See [auth](http://druid.io/docs/latest/design/auth.html) and druid-basic-security extension
ru: Druid поддерживает базовую аутентификацию. См. [auth](http://druid.io/docs/latest/design/auth.html)

source: Show Druid Datasource
ru: Показать Источники Данных Druid

source: Add Druid Datasource
ru: Добавить Источник Данных Druid

source: Edit Druid Datasource
ru: Редактировать Источник Данных Druid

source: The list of charts associated with this table. By altering this datasource, you may change how these associated charts behave. Also note that charts need to point to a datasource, so this form will fail at saving if removing charts from a datasource. If you want to change the datasource for a chart, overwrite the chart from the 'explore view'
ru: Список графиков, связанных с этой таблицей. Изменяя этот источник данных, можно изменить поведение связанных с ним графиков. Также обратите внимание, что графики должны указывать на источник данных, поэтому эта форма не будет сохранена при удалении графиков из источника данных. Если вы хотите изменить источник данных для графика, сделайте это в свойствах самого графика.

source: Timezone offset (in hours) for this datasource
ru: Смещение часового пояса (в часах) для этого источника данных

source: Time expression to use as a predicate when retrieving distinct values to populate the filter component. Only applies when `Enable Filter Select` is on. If you enter `7 days ago`, the distinct list of values in the filter will be populated based on the distinct value over the past week
ru: Выражение времени используется в качестве предиката при получении различных значений для заполнения компонента фильтра. Применяется только в том случае, если включен параметр «включить выбор фильтра». Если Вы введете «7 дней назад», то список различных значений в фильтре будет заполнен на основе определенного значения за последнюю неделю

source: Whether to populate the filter's dropdown in the explore view's filter section with a list of distinct values fetched from the backend on the fly
ru: Получение списка фильтруемых значений, выполняя онлайн-запрос к серверу

source: Redirects to this endpoint when clicking on the datasource from the datasource list
ru: Перенаправление на эту конечную точку при нажатии на источник данных из списка источников данных

source: Duration (in seconds) of the caching timeout for this datasource. A timeout of 0 indicates that the cache never expires. Note this defaults to the cluster timeout if undefined.
ru: Длительность (в секундах) таймаута кэша для этого источника данных. Таймаут, равный 0, - кеш не удаляется. Это стандартное глобальное значение, если не определено другое.

source: Associated Charts
ru: Связанные диаграммы

source: Data Source
ru: Источник данных

source: Cluster
ru: Кластер

source: Owners
ru: Владельцы

source: Is Hidden
ru: Скрыто

source: Enable Filter Select
ru: Включить Онлайн Фильтр

source: Default Endpoint
ru: Конечная точка по умолчанию

source: Time Offset
ru: Смещение Времени

source: Datasource Name
ru: Название таблицы

source: Fetch Values From
ru: Извлечь значения из

source: Changed By
ru: Изменено

source: Modified
ru: Изменено

source: Refreshed metadata from cluster [{}]
ru: Обновить метаданные из кластера [{}]

source: Only `SELECT` statements are allowed
ru: Разрешены только `SELECT` запросы

source: Only single queries supported
ru: Поддерживаются только одиночные запросы

source: Error in jinja expression in fetch values predicate: %(msg)s
ru: Ошибка в jinja выражении: %(msg)s

source: Error in jinja expression in FROM clause: %(msg)s
ru: Ошибка в jinja выражении: %(msg)s

source: Virtual dataset query cannot consist of multiple statements
ru: Виртуальный запрос набора данных не может состоять из нескольких операторов

source: Virtual dataset query must be read-only
ru: Виртуальный запрос набора данных должен быть только для чтения

source: Error in jinja expression in RLS filters: %(msg)s
ru: Ошибка в jinja выражении: %(msg)s

source: Datetime column not provided as part table configuration and is required by this type of chart
ru: Для данной диаграммы необходим временной ряд. Укажите столбец с датой в соответствующем поле раздела [Время]

source: Empty query?
ru: Пустой запрос?

source: Metric '%(metric)s' does not exist
ru: Значение '%(metric)s' не существует

source: Invalid filter operation type: %(op)s
ru: Неверный тип операции: %(op)s

source: Error in jinja expression in WHERE clause: %(msg)s
ru: Ошибка в jinja выражении: %(msg)s

source: Error in jinja expression in HAVING clause: %(msg)s
ru: Ошибка в jinja выражении: %(msg)s

source: Show Column
ru: Показать столбец

source: Add Column
ru: Добавить столбец

source: Edit Column
ru: Редактировать столбец

source: Whether to make this column available as a [Time Granularity] option, column has to be DATETIME or DATETIME-like
ru: Чтобы делать этот столбец доступным в разделе [Время] столбец должен быть в формате DATETIME или DATETIME-like

source: The data type that was inferred by the database. It may be necessary to input a type manually for expression-defined columns in some cases. In most case users should not need to alter this.
ru: Задать тип данных. В некоторых случаях может потребоваться ввести тип вручную для столбцов, которые формируются специальными запросами. В большинстве случаев изменять содержимое этого поля не обязательно.

source: Table
ru: Таблица

source: Expression
ru: Выражение SQL

source: Is temporal
ru: Содержит дату /время

source: Datetime Format
ru: Формат Datetime

source: Invalid date/timestamp format
ru: Неверный формат Даты / Времени

source: Show Metric
ru: Показать показатель

source: Add Metric
ru: Добавить показатель

source: Edit Metric
ru: Редактировать показатель

source: SQL Expression
ru: Выражение SQL

source: D3 Format
ru: Формат D3

source: Extra
ru: Дополнительно

source: Row level security filter
ru: Фильтр безопасности на уровне строк

source: Show Row level security filter
ru: Показать фильтр безопасности на уровне строк

source: Add Row level security filter
ru: Добавить фильтр безопасности на уровне строк

source: Edit Row level security filter
ru: Редактирование фильтра безопасности на уровне строк

source: Regular filters add where clauses to queries if a user belongs to a role referenced in the filter. Base filters apply filters to all queries except the roles defined in the filter, and can be used to define what users can see if no RLS filters within a filter group apply to them.
ru: Обычные фильтры добавляют условия к запросам, если пользователь принадлежит роли, указанной в фильтре. Основные фильтры применяются ко всем запросам, кроме ролей, заданных в фильтре, и могут использоваться для ограничения пользовательского доступа, если к ним не применены фильтры RLS в группе фильтров.

source: These are the tables this filter will be applied to.
ru: Таблицы, к которым этот фильтр будет применен.

source: For regular filters, these are the roles this filter will be applied to. For base filters, these are the roles that the filter DOES NOT apply to, e.g. Admin if admin should see all data.
ru: Для обычных фильтров: роли, к которым будет применен фильтр. Для основных фильтров: роли, для которых не будет применён фильтр. Например, Admin, если администратор должен видеть все данные.
