Repository: amadev/incubator-superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ru

source: Schedule Email Reports for Dashboards
ru: Планирование отчетов по электронной почте для дашбордов

source: Manage Email Reports for Dashboards
ru: Управление рассылками отчётов для дашбордов

source: Changed On
ru: Изменено

source: Active
ru: Действия

source: Crontab
ru: Кронтаб

source: Recipients
ru: Получатели

source: Slack Channel
ru: Неактивный канал

source: Deliver As Group
ru: Доставить как Группу

source: Delivery Type
ru: Тип доставки

source: Schedule Email Reports for Charts
ru: Планирование отчетов по электронной почте для диаграмм

source: Manage Email Reports for Charts
ru: Управление отчетов по электронной почте для диаграмм

source: Email Format
ru: Формат рассылки

source: List Saved Query
ru: Список сохраненных запросов

source: Show Saved Query
ru: Показать сохраненный запрос

source: Add Saved Query
ru: Добавить сохраненный запрос

source: Edit Saved Query
ru: Изменить сохраненный запрос

source: End Time
ru: Время окончания

source: Pop Tab Link
ru: Открыть

source: Changed on
ru: Изменено

source: Could not determine datasource type
ru: Не удалось определить тип источника данных

source: Could not find viz object
ru: Не удалось найти объект визуализации

source: Show Chart
ru: Показать диаграмму

source: Add Chart
ru: Добавить диаграмму

source: Edit Chart
ru: Редактировать диаграмму

source: These parameters are generated dynamically when clicking the save or overwrite button in the explore view. This JSON object is exposed here for reference and for power users who may want to alter specific parameters.
ru: Эти параметры генерируются автоматически при нажатии кнопки сохранения. Опытные пользователи могут изменить определенные объекты в формате JSON.

source: Duration (in seconds) of the caching timeout for this chart. Note this defaults to the datasource/table timeout if undefined.
ru: Длительность (в секундах) таймаута кэша для этого графика.

source: Last Modified
ru: Изменено

source: Parameters
ru: Параметры

source: Visualization Type
ru: Тип визуализации

source: Show Dashboard
ru: Показать дашборд

source: Add Dashboard
ru: Добавить дашборд

source: Edit Dashboard
ru: Редактировать дашборд

source: This json object describes the positioning of the widgets in the dashboard. It is dynamically generated when adjusting the widgets size and positions by using drag & drop in the dashboard view
ru: Этот объект JSON описывает расположение виджетa в отчёте. Он автоматически генерируется при настройке размера и позиций виджета на странице дашборда.

source: The CSS for individual dashboards can be altered here, or in the dashboard view where changes are immediately visible
ru: CSS для отдельных дашбордов можно изменить здесь или в самом дашборде.

source: To get a readable URL for your dashboard
ru: Получить читаемый URL-адрес для дашборда

source: This JSON object is generated dynamically when clicking the save or overwrite button in the dashboard view. It is exposed here for reference and for power users who may want to alter specific parameters.
ru: Эти объекты JSON генерируются автоматически при нажатии кнопки сохранения. Опытные пользователи могут задать собственные параметры.

source: Owners is a list of users who can alter the dashboard.
ru: Владельцы - это список пользователей, которые могут изменять отчёт.

source: Determines whether or not this dashboard is visible in the list of all dashboards
ru: Определяет, отображается ли этот дашборд в общем списке дашбордов

source: Title
ru: Заголовок

source: Slug
ru: Читаемый URL

source: Published
ru: опубликованный

source: Position JSON
ru: Позиция JSON

source: Underlying Tables
ru: Базовые таблицы

source: Export
ru: Экспорт

source: Export dashboards?
ru: Экспортировать дашборды?

source: Name of table to be created from csv data.
ru: Имя таблицы, которая будет сформирована из данных csv.

source: CSV File
ru: CSV Файл

source: Select a CSV file to be uploaded to a database.
ru: Выберите файл CSV, чтобы загрузить в БД.

source: Only the following file extensions are allowed: %(allowed_extensions)s
ru: Только следующие расширения файла возможны: %(allowed_extensions)s

source: Specify a schema (if database flavor supports this).
ru: Укажите схему (если это поддерживается базой данных).

source: Delimiter
ru: Разделитель

source: Delimiter used by CSV file (for whitespace use \s+).
ru: Разделитель, используемый CSV-файлом (для пробелов используется \s+).

source: Table Exists
ru: Таблица существует

source: If table exists do one of the following: Fail (do nothing), Replace (drop and recreate table) or Append (insert data).
ru: Если таблица уже существует, выполните одно из следующих действий: Fail (ничего не делать), Replace (удалить и заново создать таблицу) или Append (добавить данные).

source: Fail
ru: Игнорировать

source: Replace
ru: Заменить

source: Append
ru: Добавить

source: Header Row
ru: Строка заголовков

source: Row containing the headers to use as column names (0 is first line of data). Leave empty if there is no header row.
ru: Строка, содержащая заголовки для использования в качестве имен столбцов (0 - первая строка данных). Оставьте пустым, если строка заголовка отсутствует.

source: Index Column
ru: Столбец индекса

source: Column to use as the row labels of the dataframe. Leave empty if no index column.
ru: Столбец для использования в качестве названия строк датафрейма. Оставьте пустым, если столбец индекса отсутствует.

source: Mangle Duplicate Columns
ru: Исключить повторяющиеся столбцы

source: Specify duplicate columns as "X.0, X.1".
ru: Если есть столбцы с одинаковым именем, то присвоить им порядковые номера - столбец1, столбец2, … и т.д.

source: Skip Initial Space
ru: Убрать пробелы

source: Skip spaces after delimiter.
ru: Пропустить пробелы после разделителя.

source: Skip Rows
ru: Пропустить

source: Number of rows to skip at start of file.
ru: Количество строк, которые нужно проигнорировать в начале файла.

source: Rows to Read
ru: Строки для чтения

source: Number of rows of file to read.
ru: Количество строк файла для чтения.

source: Skip Blank Lines
ru: Пропустить пустые строки

source: Skip blank lines rather than interpreting them as NaN values.
ru: Пропустить пустые строки, а не интерпретировать их как значения NaN.

source: Parse Dates
ru: Анализ дат

source: A comma separated list of columns that should be parsed as dates.
ru: Разделенный запятыми список столбцов, которые должны быть проанализированы как даты.

source: Infer Datetime Format
ru: Определить формат даты и времени

source: Use Pandas to interpret the datetime format automatically.
ru: Используйте Pandas для автоматической интерпретации формата даты и времени.

source: Decimal Character
ru: Десятичный символ

source: Character to interpret as decimal point.
ru: Символ для интерпретации десятичной точки.

source: Dataframe Index
ru: Индекс датафрейма

source: Write dataframe index as a column.
ru: Записывайте индекс датафрейма в виде столбца.

source: Column Label(s)
ru: Обозначения столбцов

source: Column label for index column(s). If None is given and Dataframe Index is True, Index Names are used.
ru: Обозначение столбца для столбцов с индексами. Если поле пустое, а индекс датафрейма включён, то используются имена индексов.

source: Null values
ru: Значения Null

source: Json list of the values that should be treated as null. Examples: [""], ["None", "N/A"], ["nan", "null"]. Warning: Hive database supports only single value. Use [""] for empty string.
ru: Список значений, которые должны обрабатываться как нулевые. Примеры: [""], ["None", "N/A"], ["nan", "null"]. Предупреждение: БД Hive поддерживает только одно значение. Используйте [""] в качестве пустой строки.

source: Name of table to be created from excel data.
ru: Имя таблицы, которая будет сформирована из данных excel.

source: Excel File
ru: Файл Excel

source: Select an Excel file to be uploaded to a database.
ru: Выберите файл excel, который будет загружен в БД.

source: Sheet Name
ru: Имя листа

source: Strings used for sheet names (default is the first sheet).
ru: Строки, используемые для имен листов (по умолчанию первый лист).

source: Show Database
ru: Показать Базу Данных

source: Add Database
ru: Добавить Базу Данных

source: Edit Database
ru: Редактировать Базу Данных

source: Expose this DB in SQL Lab
ru: Показать базу данных в SQL Редакторе

source: Operate the database in asynchronous mode, meaning that the queries are executed on remote workers as opposed to on the web server itself. This assumes that you have a Celery worker setup as well as a results backend. Refer to the installation docs for more information.
ru: Работа базы данных в асинхронном режиме означает выполнение запросов на отдельных нодах, а не в самом приложении. Предполагается, что у вас есть установка Celery worker, а также результаты бэкенда. Дополнительные сведения см. в документации по установке.

source: Allow CREATE TABLE AS option in SQL Lab
ru: Разрешить выполнять инструкцию CREATE TABLE AS в редакторе SQL

source: Allow CREATE VIEW AS option in SQL Lab
ru: Разрешить выполнять инструкцию CREATE VIEW AS в редакторе SQL

source: Allow users to run non-SELECT statements (UPDATE, DELETE, CREATE, ...) in SQL Lab
ru: Позволяет пользователям запускать инструкции (UPDATE, DELETE, CREATE, …) без SELECT в редакторе SQL

source: When allowing CREATE TABLE AS option in SQL Lab, this option forces the table to be created in this schema
ru: При разрешении инструкции CREATE TABLE AS в редакторе SQL эта опция создаст таблицу в выбранной схеме

source: If Presto, all the queries in SQL Lab are going to be executed as the currently logged on user who must have permission to run them.<br/>If Hive and hive.server2.enable.doAs is enabled, will run the queries as service account, but impersonate the currently logged on user via hive.server2.proxy.user property.
ru: Если вы используете Presto, все запросы в SQL-Редакторе будут выполняться от авторизованного пользователя, который должен иметь разрешение на их выполнение. <br/> Если включен Hive, то запросы будут выполняться через техническую учетную запись, но ассоциировать зарегистрированного пользователя можно через свойство hive.server2.proxy.user.

source: Allow SQL Lab to fetch a list of all tables and all views across all database schemas. For large data warehouse with thousands of tables, this can be expensive and put strain on the system.
ru: Разрешить SQL-редактору получать списки всех таблиц из всех схем баз данных. При наличии объёмного хранилища данных с тысячами таблиц это может оказать серьёзную нагрузку на систему.

source: Duration (in seconds) of the caching timeout for charts of this database. A timeout of 0 indicates that the cache never expires. Note this defaults to the global timeout if undefined.
ru: Длительность (в секундах) таймаута кэша для этой таблицы. Таймаут, равный 0, - кеш не удаляется. Это стандартное глобальное значение, если не определено другое.

source: If selected, please set the schemas allowed for csv upload in Extra.
ru: Если выбрано, пожалуйста, установите схемы, разрешенные для загрузки CSV в Extra.

source: Expose in SQL Lab
ru: Открыть в SQL редакторе

source: Allow CREATE TABLE AS
ru: Разрешить CREATE TABLE AS

source: Allow CREATE VIEW AS
ru: Разрешить CREATE VIEW AS

source: Allow DML
ru: Разрешить DML

source: CTAS Schema
ru: Схема по умолчанию

source: Chart Cache Timeout
ru: Тайм-аут кэша графика

source: Secure Extra
ru: Дополнительные настройки безопасности

source: Root certificate
ru: Корневой сертификат

source: Async Execution
ru: Асинхронное выполнение

source: Impersonate the logged on user
ru: Ассоциировать пользователя

source: Allow Csv Upload
ru: Разрешить Загрузку Csv

source: Allow Multi Schema Metadata Fetch
ru: Разрешить сбор метаданных для нескольких схем

source: Backend
ru: Бэкенд

source: Extra field cannot be decoded by JSON. %(msg)s
ru: Дополнительное поле не может быть получено с помощью JSON. %(msg)s

source: Invalid connection string, a valid string usually follows:'DRIVER://USER:PASSWORD@DB-HOST/DATABASE-NAME'<p>Example:'postgresql://user:password@your-postgres-db/database'</p>
ru: Неверная строка подключения

source: CSV to Database configuration
ru: Конфигурация CSV в БД

source: Database "%(database_name)s" schema "%(schema_name)s" is not allowed for csv uploads. Please contact your Superset Admin.
ru: Запрещено загружать CSV в базу данных "%(database_name)s" схему "%(schema_name)s"

source: You cannot specify a namespace both in the name of the table: "%(csv_table.table)s" and in the schema field: "%(csv_table.schema)s". Please remove one
ru: Указывать неймспейс в таблице и схеме сразу невозможно: "%(csv_table.table)s", "%(csv_table.schema)s\

source: Unable to upload CSV file "%(filename)s" to table "%(table_name)s" in database "%(db_name)s". Error message: %(error_msg)s
ru: CSV-файл "%(filename)s" не может быть загружен в таблицу "%(table_name)s" базы данных "%(db_name)s". Ошибка: %(error_msg)s

source: CSV file "%(csv_filename)s" uploaded to table "%(table_name)s" in database "%(db_name)s"
ru: CSV-файл "%(csv_filename)s" загружен в таблицу "%(table_name)s" базы данных "%(db_name)s"

source: Excel to Database configuration
ru: Конфигурация Excel в БД

source: Database "%(database_name)s" schema "%(schema_name)s" is not allowed for excel uploads. Please contact your Superset Admin.
ru: Запрещено загружать Excel в базу данных "%(database_name)s" схему "%(schema_name)s"

source: You cannot specify a namespace both in the name of the table: "%(excel_table.table)s" and in the schema field: "%(excel_table.schema)s". Please remove one
ru: Указывать неймспейс в таблице и схеме сразу невозможно: "%(excel_table.table)s", "%(excel_table.schema)s"

source: Unable to upload Excel file "%(filename)s" to table "%(table_name)s" in database "%(db_name)s". Error message: %(error_msg)s
ru: Excel-файл "%(filename)s" не может быть загружен в таблицу "%(table_name)s" базы данных "%(db_name)s". Ошибка: %(error_msg)s

source: Excel file "%(excel_filename)s" uploaded to table "%(table_name)s" in database "%(db_name)s"
ru: Excel-файл "%(excel_filename)s" загружен в таблицу "%(table_name)s" базы данных "%(db_name)s"

source: Logs
ru: Журналы

source: Show Log
ru: Показать журнал

source: Add Log
ru: Добавить журнал

source: Edit Log
ru: Редактировать журнал

source: Action
ru: Действие

source: dttm
ru: Дата и время

source: Add Item
ru: Добавить элемент

source: The query couldn't be loaded
ru: Невозможно загрузить запрос

source: Your query was saved
ru: Ваш запрос был сохранен

source: Your query could not be saved
ru: Ваш запрос не может быть сохранен

source: Your query was updated
ru: Ваш запрос был обновлён

source: Your query could not be updated
ru: Ваш запрос не может быть обновлён

source: Your query has been scheduled. To see details of your query, navigate to Saved Queries
ru: Ваш запрос был запланирован. Чтобы просмотреть подробную информацию о запросе, перейдите к сохранённым запросам

source: Your query could not be scheduled
ru: Ваш запрос не может быть запланирован

source: Failed at retrieving results
ru: Не удалось получить результаты

source: An error occurred while storing the latest query id in the backend. Please contact your administrator if this problem persists.
ru: Произошла ошибка при сохранении последнего идентификатора запроса на сервер. Пожалуйста, обратитесь к администратору.

source: Unknown error
ru: Неизвестная ошибка

source: Query was stopped.
ru: Запрос прерван.

source: Unable to migrate table schema state to backend. Superset will retry later. Please contact your administrator if this problem persists.
ru: Невозможно передать состояние схемы таблицы на сервер. Superset попробует сделать это позже. Пожалуйста, обратитесь к администратору.

source: Unable to migrate query state to backend. Superset will retry later. Please contact your administrator if this problem persists.
ru: Невозможно передать состояние запроса на сервер. Superset попробует сделать это позже. Пожалуйста, обратитесь к администратору.

source: Unable to migrate query editor state to backend. Superset will retry later. Please contact your administrator if this problem persists.
ru: Невозможно передать состояние редактора на сервер. Superset попробует сделать это позже. Пожалуйста, обратитесь к администратору.

source: Unable to add a new tab to the backend. Please contact your administrator.
ru: Невозможно добавить новую вкладку для внутреннего интерфейса. Пожалуйста, обратитесь к администратору.

source: Copy of %s
ru: Копирование %s

source: An error occurred while setting the active tab. Please contact your administrator.
ru: Произошла ошибка при установке активной вкладки. Пожалуйста, обратитесь к администратору.

source: An error occurred while fetching tab state
ru: Произошла ошибка при получении данных вкладки

source: An error occurred while removing tab. Please contact your administrator.
ru: Произошла ошибка при удалении вкладки. Пожалуйста, обратитесь к администратору.

source: An error occurred while removing query. Please contact your administrator.
ru: Произошла ошибка при удалении запроса. Пожалуйста, обратитесь к администратору.

source: An error occurred while setting the tab database ID. Please contact your administrator.
ru: Произошла ошибка при установке ID базы данных для вкладки. Пожалуйста, обратитесь к администратору.

source: An error occurred while setting the tab schema. Please contact your administrator.
ru: Произошла ошибка при установке схемы вкладки. Пожалуйста, обратитесь к администратору.

source: An error occurred while setting the tab autorun. Please contact your administrator.
ru: Произошла ошибка при установке автозапуска. Пожалуйста, обратитесь к администратору.

source: An error occurred while setting the tab title. Please contact your administrator.
ru: Произошла ошибка при установке заголовка. Пожалуйста, обратитесь к администратору.

source: An error occurred while storing your query in the backend. To avoid losing your changes, please save your query using the "Save Query" button.
ru: Произошла ошибка при сохранении вашего запроса. Чтобы не потерять изменения, пожалуйста, сохраните запрос, используя кнопку "Save Query".

source: An error occurred while setting the tab template parameters. Please contact your administrator.
ru: При настройке параметров шаблона вкладки произошла ошибка. Пожалуйста, обратитесь к администратору.

source: An error occurred while fetching table metadata
ru: Произошла ошибка при получении метаданных из таблицы

source: An error occurred while fetching table metadata. Please contact your administrator.
ru: Произошла ошибка при получении метаданных из таблицы. Пожалуйста, обратитесь к администратору.

source: An error occurred while expanding the table schema. Please contact your administrator.
ru: Произошла ошибка при расширении табличной схемы. Пожалуйста, обратитесь к администратору.

source: An error occurred while collapsing the table schema. Please contact your administrator.
ru: Произошла ошибка при сжатии схемы таблицы. Пожалуйста, обратитесь к администратору.

source: An error occurred while removing the table schema. Please contact your administrator.
ru: Произошла ошибка при удалении табличной схемы. Пожалуйста, обратитесь к администратору.

source: Sjsonhared query
ru: Общий запрос

source: The datasource couldn't be loaded
ru: Источник данных невозможно загрузить

source: An error occurred while creating the data source
ru: Произошла ошибка при создании источника данных

source: SQL Lab uses your browser's local storage to store queries and results. Currently, you are using ${currentUsage.toFixed( 2, )} KB out of ${LOCALSTORAGE_MAX_USAGE_KB} KB. storage space. To keep SQL Lab from crashing, please delete some query tabs. You can re-access these queries by using the Save feature before you delete the tab. Note that you will need to close other SQL Lab windows before you do this.
ru: SQL лабоработия использует локальное хранилище браузера для хранения запросов и результатов. Сейчас вы используете ${currentUsage.toFixed( 2, )} KB out of ${LOCALSTORAGE_MAX_USAGE_KB} KB. storage space. Чтобы редактор SQL работал исправно, удалите несколько вкладок с запросами. Вы можете вернуться к запросу, сохранив его перед тем, как закрыть вкладку. Перед этим вам нужно закрыть остальные окна редактора SQL.

source: Estimate Selected Query Cost
ru: Оценить выбранный запрос

source: Estimate Query Cost
ru: Оценить запрос

source: Query Cost Estimate
ru: Оценка запроса

source: Creating a data source and creating a new tab
ru: Создание источника данных и добавление новой вкладки

source: An error occurred
ru: Произошла ошибка

source: Explore the result set in the data exploration view
ru: Исследуйте набор результатов в режиме просмотра данных

source: Explore
ru: Обзор

source: This query took %s seconds to run,
ru: Запрос выполнен за %s секунд,

source: and the explore view times out at %s seconds
ru: и время для ознакомления составляет %s секунд

source: following this flow will most likely lead to your query timing out.
ru: вероятно запрос не будет выполнен из-за ограничений по времени

source: We recommend you summarize your data further before following that flow.
ru: Рекомендуется обобщить данные перед продолжением

source: If activated you can use the
ru: Если активировано Вы можете использовать

source: feature to store a summarized data set that you can then explore.
ru: функция для хранения обобщенного набора данных, который вы можете изучить.

source: Column name(s)
ru: Имя столбца

source: cannot be used as a column name. The column name/alias "__timestamp" is reserved for the main temporal expression, and column aliases ending with double underscores followed by a numeric value (e.g. "my_col__1") are reserved for deduplicating duplicate column names. Please use aliases to rename the invalid column names.
ru: не может быть использовано как имя столбца. Имя колонки /alias "__timestamp" зарезервировано для основного временного выражения, альтернативные имена столбцов заканчиваются на двойные подчеркивания, за которыми следует числовое значение (например, "my_col__1"), зарезервированы для дедупликации повторяющихся имён колонок. Пожалуйста, используйте альтернативные имена для недопустимые имена столбцов.

source: Raw SQL
ru: Исходный SQL

source: Source SQL
ru: Источник SQL

source: Row limit must be positive integer
ru: Лимит строк должен быть положительным целым числом

source: and not greater than %s
ru: и не больше, чем %s

source: Row limit
ru: Лимит строк

source: No query history yet...
ru: История запросов пуста…

source: It seems you don't have access to any database
ru: Кажется, у Вас нет доступа к базе данных

source: An error occurred when refreshing queries
ru: Произошла ошибка при обновлении запросов

source: Filter by user
ru: Фильтр по пользователю

source: Filter by database
ru: Фильтр по базе данных

source: Query search string
ru: Строка поиска запросов

source: [From]-
ru: [От]-

source: [To]-
ru: [До]-

source: Filter by status
ru: Фильтр по статусу

source: Edit
ru: Редактировать

source: view results
ru: посмотреть результаты

source: Data preview
ru: Предпросмотр данных

source: Overwrite text in the editor with a query on this table
ru: Перезаписать текст в редакторе с запросом к этой таблице

source: Run query in a new tab
ru: Выполнить запрос на новой вкладке

source: Remove query from log
ru: Удалить запрос из журнала

source: An error occurred saving dataset
ru: Произошла ошибка при сохранении набора данных

source: .CSV
ru: Экспорт в CSV

source: Clipboard
ru: Буфер обмена

source: Filter Results
ru: Результаты фильтра

source: Parameter Error
ru: Ошибка параметра

source: Database Error
ru: Ошибка базы данных

source: was created
ru: создан

source: Query in a new tab
ru: Запрос в отдельной вкладке
