Repository: amadev/incubator-superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ru

source: Filters with the same group key will be ORed together within the group, while different filter groups will be ANDed together. Undefined group keys are treated as unique groups, i.e. are not grouped together. For example, if a table has three filters, of which two are for departments Finance and Marketing (group key = 'department'), and one refers to the region Europe (group key = 'region'), the filter clause would apply the filter (department = 'Finance' OR department = 'Marketing') AND (region = 'Europe').
ru: Фильтры с одинаковым групповым ключом будут объединены в группе оператором OR, тогда как группы с разными фильтрами будут объединены оператором AND. Неопределённые групповые ключи рассматриваются как уникальные группы, то есть не объединяются. Например, если в таблице есть три фильтра, два из которых для секторов Финансов и Маркетинга (групповой ключ = «сектор») и один относится к региону Европы (групповой ключ = «регион»), то условие фильтра будет выглядеть так: (сектор = «Финансы» OR сектор = «Маркетинг») AND (регион = «Европа»).

source: This is the condition that will be added to the WHERE clause. For example, to only return rows for a particular client, you might define a regular filter with the clause `client_id = 9`. To display no rows unless a user belongs to a RLS filter role, a base filter can be created with the clause `1 = 0` (always false).
ru: Это условие, которое будет добавлено к оператору WHERE. Например, чтобы вернуть строки определенному клиенту, вы можете определить обычный фильтр с условием `client_id = 9`. Чтобы не отображать строки, если пользователь не принадлежит к роли фильтра RLS, можно создать основной фильтр с условием `1 = 0` (всегда false).

source: Tables
ru: Таблицы

source: Roles
ru: Роли

source: Clause
ru: Условие

source: Creator
ru: Автор

source: Show Table
ru: Показать таблицу

source: Import a table definition
ru: Импорт определения таблицы

source: Edit Table
ru: Редактировать таблицу

source: Name of the table that exists in the source database
ru: Имя таблицы, которая существует в исходной базе данных

source: Schema, as used only in some databases like Postgres, Redshift and DB2
ru: Схема используется только в некоторых базах данных, таких как Postgres, Redshift и DB2

source: This fields acts a Superset view, meaning that Superset will run a query against this string as a subquery.
ru: Это поле будет выполнять запрос в качестве подзапроса.

source: Predicate applied when fetching distinct value to populate the filter control component. Supports jinja template syntax. Applies only when `Enable Filter Select` is on.
ru: Предикат применяется при получении значений для компонента - «Фильтр». Поддерживает синтаксис jinja. Применяется только в том случае, если включен параметр «Включить Выбор Фильтра».

source: Redirects to this endpoint when clicking on the table from the table list
ru: Перенаправление на эту конечную точку при нажатии на таблицу в общем списке

source: Whether the table was generated by the 'Visualize' flow in SQL Lab
ru: Если таблица была сгенерирована с помощью визуализации в SQL Lab

source: A set of parameters that become available in the query using Jinja templating syntax
ru: Набор параметров, которые становятся доступными в запросе с использованием Jinja синтаксиса шаблонизации

source: Duration (in seconds) of the caching timeout for this table. A timeout of 0 indicates that the cache never expires. Note this defaults to the database timeout if undefined.
ru: Длительность (в секундах) таймаута кэша для этой таблицы. Таймаут, равный 0, - кеш не удаляется. Это стандартное глобальное значение, если не определено другое.

source: Database
ru: База данных

source: Last Changed
ru: Последнее изменение

source: Schema
ru: Схема

source: Offset
ru: Смещение

source: Table Name
ru: Имя Таблицы

source: Fetch Values Predicate
ru: Извлечь Значения Предиката

source: Main Datetime Column
ru: Основной столбец с датой

source: SQL Lab View
ru: Лаборатория SQL

source: Template parameters
ru: Параметры шаблона

source: The table was created. As part of this two-phase configuration process, you should now click the edit button by the new table to configure it.
ru: Таблица была создана. Нажмите на кнопку редактирования напротив новой таблицы, чтобы настроить её.

source: Refresh Metadata
ru: Обновить метаданные

source: Refresh column metadata
ru: Обновить метаданные столбцов

source: Metadata refreshed for the following table(s): %(tables)s
ru: Метаданные обновлены для следующих таблиц: %(tables)s

source: The following tables added new columns: %(tables)s
ru: Новые столбцы появились в следующих таблицах: %(tables)s

source: The following tables removed columns: %(tables)s
ru: Столбцы удалены в следующих таблицах: %(tables)s

source: The following tables update column metadata: %(tables)s
ru: Метаданные столбцов обновились в следующих таблицах: %(tables)s

source: Unable to refresh metadata for the following table(s): %(tables)s
ru: Невозможно обновить метаданные для следующих таблиц: %(tables)s

source: Deleted %(num)d css template
ru: Удалено шаблонов css %(num)d

source: CSS template could not be deleted.
ru: Шаблон CSS не может быть удален.

source: CSS template not found.
ru: Шаблоны CSS не найдены

source: Deleted %(num)d dashboard
ru: Дашбордов удалено: %(num)d

source: Title or Slug
ru: Заголовок или

source: Must be unique
ru: Должно быть уникальным

source: Dashboard parameters are invalid.
ru: Неверные параметры дашборда

source: Dashboard not found.
ru: Дашборд не найден

source: Dashboard could not be created.
ru: Дашборд не может быть сохранен.

source: Dashboards could not be deleted.
ru: Дашборд не может быть удален.

source: Dashboard could not be updated.
ru: Дашборд не может быть сохранен

source: Dashboard could not be deleted.
ru: Дашборд не может быть удален.

source: Changing this Dashboard is forbidden
ru: Изменение этого дашборда запрещено

source: Import dashboard failed for an unknown reason
ru: Импорт дашборда не удался по неизвестным причинам

source: No data in file
ru: Нет данных в файле

source: Could not load database driver: {}
ru: Не удалось загрузить драйвер базы данных: {}

source: Connection failed, please check your connection settings
ru: Не удалось установить соединение, пожалуйста, проверьте параметры подключения

source: Unexpected error occurred, please check your logs for details
ru: Неожиданная ошибка, пожалуйста, проверьте журналы

source: Table name undefined
ru: Имя Таблицы не определено

source: Invalid connection string, a valid string usually follows: dirver://user:password@database-host/database-name
ru: Недействительная строка соединения. Действительная строка соединения: dirver://user:password@database-host/database-name.

source: SQLite database cannot be used as a data source for security reasons.
ru: База данных SQLite не может быть использована как источник данных.

source: Field cannot be decoded by JSON. %(msg)s
ru: Поле не может быть считано JSON. %(msg)s

source: The metadata_params in Extra field is not configured correctly. The key %(key)s is invalid.
ru: Параметр metadata_params в поле Extra определен неправильно. Ключ %(key)s неверный.

source: Database parameters are invalid.
ru: Неверные параметры базы данных

source: A database with the same name already exists
ru: База данных с таким именем уже существует

source: Field is required
ru: Поле, обязательное для заполнения

source: Field cannot be decoded by JSON. %{json_error}s
ru: Поле не может быть считано JSON. %{json_error}s

source: The metadata_params in Extra field is not configured correctly. The key %{key}s is invalid.
ru: Параметр metadata_params в поле Extra определен неправильно. Ключ %(key)s неверный.

source: Database not found.
ru: База данных не найдена

source: Database could not be created.
ru: База данных не может быть сохранена

source: Database could not be updated.
ru: База данных не может быть обновлена

source: Could not connect to database.
ru: Не удалось подключиться к базе данных.

source: Cannot delete a database that has tables attached
ru: Невозможно удалить базу данных, которая имеет присоединённые таблицы

source: Database could not be deleted.
ru: База данных не может быть удалена

source: Stopped an unsafe database connection
ru: Остановлено небезопасное соединение базы данных

source: Import database failed for an unknown reason
ru: Ошибка импорта базы данных по неизвестной причине

source: Deleted %(num)d dataset
ru: Удалено наборов данных: %(num)d

source: Null or Empty
ru: Null или Empty

source: Database not allowed to change
ru: Изменение базы данных не допускается

source: One or more columns do not exist
ru: Один или несколько столбцов не существует

source: One or more columns are duplicated
ru: Один или несколько столбцов дублируются

source: One or more columns already exist
ru: Один или несколько столбцов уже существует

source: One or more metrics do not exist
ru: Один или более показателей не существуют

source: One or more metrics are duplicated
ru: Один или несколько показателей дублируются

source: One or more metrics already exist
ru: Один или несколько показателей уже существуют

source: Table [%(table_name)s] could not be found, please double check your database connection, schema, and table name
ru: Не удалось найти таблицу [%(table_name)s]. Проверьте подключение к базе данных, схему и имя таблицы.

source: Dataset parameters are invalid.
ru: Неверные параметры набора данных

source: Dataset could not be created.
ru: Набор данных не может быть создан

source: Dataset could not be updated.
ru: Набор данных не может быть сохранен

source: Dataset could not be deleted.
ru: Набор данных не может быть удален

source: Dataset(s) could not be bulk deleted.
ru: Наборы данных не могут быть удалены

source: Changing this dataset is forbidden
ru: Изменение этого набора данных запрещено

source: Import dataset failed for an unknown reason
ru: Импорт набора данных не удался по неизвестным причинам

source: Unknown Presto Error
ru: Неизвестная ошибка Presto

source: We can't seem to resolve the column "%(column_name)s" at line %(location)s.
ru: Невозможно определить столбец "%(column_name)s" в %(location)s.

source: The table "%(table_name)s" does not exist. A valid table must be used to run this query.
ru: Таблица "%(table_name)s" не существует. Должна быть действительная таблица для создания запроса

source: Deleted %(num)d saved query
ru: Удалено запросов: %(num)d

source: Saved queries could not be deleted.
ru: Сохранённый запрос невозможно удалить.

source: Saved query not found.
ru: Сохраненный запрос не найден.

source: Deleted %(num)d report schedule
ru: Удалено отчётных расписаний: %(num)d

source: Alert query returned more then one row. %s rows returned
ru: Запрос вернул больше одной строки. Строк: %s

source: Alert query returned more then one column. %s columns returned
ru: Запрос вернул больше одного столбца. Столбцов: %s

source: Dashboard does not exist
ru: Дашборда не существует

source: Chart does not exist
ru: Диаграммы не существует

source: Database is required for alerts
ru: База данных необходима для предупреждения

source: Type is required
ru: Требуется тип

source: Choose a chart or dashboard not both
ru: Выберите график или дашборд

source: Report Schedule parameters are invalid.
ru: Параметры расписания отчета недействительны.

source: Report Schedule could not be deleted.
ru: Ваш запрос не может быть удалён

source: Report Schedule could not be created.
ru: Ваш запрос не может быть создан

source: Report Schedule could not be updated.
ru: Ваш запрос не может быть обновлён

source: Report Schedule not found.
ru: Расписание отчета не найдено.

source: Report Schedule delete failed.
ru: Расписание отчета не удалось удалить.

source: Report Schedule log prune failed.
ru: Ошибка очистки журнала расписания отчетов.

source: Report Schedule execution failed when generating a screenshot.
ru: Выполнение расписания не удалось при создании скриншота.

source: Report Schedule execution got an unexpected error.
ru: Выполнение расписания отчета завершилось непредвиденной ошибкой.

source: Report Schedule is still working, refusing to re-compute.
ru: Расписание отчета по-прежнему работает, отказавшись от повторных вычислений.

source: Report Schedule reached a working timeout.
ru: Расписание отчета превысило время ожидания.

source: Alert query returned more then one row.
ru: Запрос оповещения вернул более одной строки.

source: Alert validator config error.
ru: Ошибка конфигурации.

source: Alert query returned more then one column.
ru: Запрос оповещения вернул более одного столбца.

source: Alert query returned a non-number value.
ru: Запрос оповещения вернул нечисловое значение.

source: Alert fired during grace period.
ru: Оповещение возникло в период ожидания.

source: Alert ended grace period.
ru: Оповещение завершило период ожидания.

source: Alert on grace period
ru: Оповещение о периоде ожидания

source: Report Schedule sellenium user not found
ru: Отчётное расписание sellenium пользователь не найден

source: Report Schedule state not found
ru: Статус расписания отчётов не найден

source: Report schedule unexpected error
ru: Расписание отчётов сообщило о непредвиденной ошибке

source: Changing this report is forbidden
ru: Изменение этого отчета запрещено

source: <b><a href="%(url)s">Explore in Superset</a></b><p></p> <img src="cid:%(msgid)s">
ru: <b><a href="%(url)s">Посмотреть в Superset</a></b><p></p> <img src="cid:%(msgid)s">

source: *%(name)s* <%(url)s|Explore in Superset>
ru: *%(name)s* <%(url)s|Посмотреть в Superset>

source: *%(name)s* <%(url)s|Explore in Superset>
ru: *%(name)s* <%(url)s|Посмотреть в Superset>

source: <b><a href="%(url)s">Explore in Superset</a></b><p></p>
ru: <b><a href="%(url)s">Посмотреть в Superset</a></b><p></p>

source: *%(slice_name)s* <%(slice_url_user_friendly)s|Explore in Superset>
ru: *%(slice_name)s* <%(slice_url_user_friendly)s|Посмотреть в Superset>

source: [Alert] %(label)s
ru: [Оповещение] %(label)s

source: New
ru: Новый

source: SQL Query
ru: SQL Запрос

source: Chart
ru: График

source: Dashboard
ru: Дашборд

source: Profile
ru: Профиль

source: Info
ru: Инфо

source: Logout
ru: Выход из системы

source: Login
ru: Вход в систему

source: Record Count
ru: Количество записей

source: No records found
ru: Записей не найдено

source: Filter List
ru: Фильтры

source: Search
ru: Поиск

source: Refresh
ru: Обновить

source: Import dashboards
ru: Импорт дашбордов

source: Import Dashboard(s)
ru: Импорт дашборда (-ов)

source: File
ru: Файл

source: Choose File
ru: Выбрать файл

source: Upload
ru: Загрузить

source: No Access!
ru: Нет доступа!

source: You do not have permissions to access the datasource(s): %(name)s.
ru: У вас нет разрешений для доступа к источнику данных: %(name)s.

source: Request Permissions
ru: Запросить права доступа

source: Cancel
ru: Отменить

source: Use the edit buttom to change this field
ru: Используйте кнопку редактировать, чтобы изменить это поле

source: Test Connection
ru: Тестовое соединение

source: [Superset] Access to the datasource %(name)s was granted
ru: Доступ к базе данных предоставлен — %(name)s

source: Last day
ru: Последний день

source: Last week
ru: Последняя неделя

source: Last month
ru: Последний месяц

source: Last quarter
ru: Последний квартал

source: Last year
ru: Последний год

source: Referenced columns not available in DataFrame.
ru: Указанные столбцы не доступны в датафрейме.

source: Column referenced by aggregate is undefined: %(column)s
ru: Столбцы, указанные в заполнителе не определены: %(column)s

source: Operator undefined for aggregator: %(name)s
ru: Оператор не определен для заполнителя: %(name)s

source: Invalid numpy function: %(operator)s
ru: Неверная функция numpy: %(operator)s

source: Pivot operation requires at least one index
ru: Операция Pivot требует по меньшей мере один индекс

source: Pivot operation must include at least one aggregate
ru: Операция Pivot должна включать хотя бы один заполнитель

source: Undefined window for rolling operation
ru: Не определено окно для операции rolling

source: Invalid rolling_type: %(type)s
ru: Неверный rolling_type: %(type)s

source: Invalid options for %(rolling_type)s: %(options)s
ru: Неверные параметры %(rolling_type)s: %(options)s

source: Invalid cumulative operator: %(operator)s
ru: Неверный оператор накопления: %(operator)s

source: Invalid geohash string
ru: Недопустимая строка geohash

source: Invalid longitude/latitude
ru: Неверная долгота/широта

source: Invalid geodetic string
ru: Invalid геодезическая строка

source: `fbprophet` package not installed
ru: `Fbprophet` пакет не установлен

source: Time grain missing
ru: Не хватает периода времени

source: Unsupported time grain: %(time_grain)s
ru: Неподдерживаемый период времени: %(time_grain)s

source: Periods must be a positive integer value
ru: Периоды должны включать целые положительные числа

source: Confidence interval must be between 0 and 1 (exclusive)
ru: Доверительный интервал должен быть между 0 и 1 (эксклюзивным)

source: DataFrame must include temporal column
ru: Датафрейм должен включать в себя временную колонку

source: DataFrame include at least one series
ru: Пожалуйста, выберите хотя бы одну последовательность

source: percentiles must be a list or tuple with two numeric values, of which the first is lower than the second value
ru: персентили должны быть списком с двумя численными значениями, из которых первое должно быть меньше второго

source: User
ru: Пользователь

source: User Roles
ru: Роли пользователей

source: Database URL
ru: URL базы данных

source: Roles to grant
ru: Роли для предоставления

source: Created On
ru: Дата создания

source: List Observations
ru: Список наблюдений

source: Show Observation
ru: Показать наблюдение

source: Error Message
ru: Сообщение об ошибке

source: Log Retentions (days)
ru: Срок хранения системного журнала (дни)

source: A semicolon ';' delimited list of email addresses
ru: Через точку с запятой «;» разделяется список адресов электронной почты

source: How long to keep the logs around for this alert
ru: Как долго хранить журналы этого предупреждения

source: Once an alert is triggered, how long, in seconds, before Superset nags you again.
ru: Период между повторными оповещениями Superset в секундах.

source: A SQL statement that defines whether the alert should get triggered or not. The query is expected to return either NULL or a number value.
ru: Выражение SQL определяющее должно ли сработать оповещение. Запрос вернет либо NULL, либо числовое значение.

source: annotation start time or end time is required.
ru: аннотации требуется время начала или окончания времени.

source: Annotation end time must be no earlier than start time.
ru: Время окончания аннотации не должно быть раньше, чем время старта.

source: Annotations
ru: Аннотации

source: Show Annotation
ru: Показать аннотацию

source: Add Annotation
ru: Добавить аннотацию

source: Edit Annotation
ru: Изменить аннотацию

source: Layer
ru: Слой

source: Label
ru: Метка

source: Start
ru: Старт

source: End
ru: Конец

source: JSON Metadata
ru: Метаданные JSON

source: Show Annotation Layer
ru: Показать слои аннотаций

source: Add Annotation Layer
ru: Добавить слой аннотации

source: Edit Annotation Layer
ru: Изменить слой аннотации

source: Name
ru: Название

source: Datasource %(name)s already exists
ru: Источник данных %(name)s уже существует

source: Table [%{table}s] could not be found, please double check your database connection, schema, and table name, error: {}
ru: Не удалось найти таблицу [{}]. Проверьте подключение к базе данных, схему и имя таблицы, ошибка: {}.

source: json isn't valid
ru: json недействителен

source: Export to YAML
ru: Экспорт в YAML

source: Export to YAML?
ru: Экспортировать в YAML?

source: Delete
ru: Удалить

source: Delete all Really?
ru: Удалить все?

source: Is favorite
ru: Избранное

source: The data source seems to have been deleted
ru: Источник данных, похоже, был удален

source: The user seems to have been deleted
ru: Пользователь, кажется, был удален

source: Access was requested
ru: Запрошен доступ

source: The access requests seem to have been deleted
ru: Запросы доступа, похоже, были удалены

source: %(user)s was granted the role %(role)s that gives access to the %(datasource)s
ru: %(user)s была предоставлена роль %(role)s, которая дает доступ к ресурсам %(datasource)s

source: Role %(r)s was extended to provide the access to the datasource %(ds)s
ru: Роль %(r) s была расширена для обеспечения доступа к источнику данных %(ds)s

source: You have no permission to approve this request
ru: У вас нет разрешения на утверждение этого запроса

source: Cannot import dashboard: %(db_error)s. Make sure to create the database before importing the dashboard.
ru: Невозможно импортировать дашборд: %(db_error)s.

source: An unknown error occurred. Please contact your Superset administrator
ru: Произошла неизвестная ошибка. Пожалуйста, обратитесь к администратору Superset

source: You don't have the rights to
ru: У вас нет прав на

source: alter this
ru: изменить этот

source: chart
ru: график

source: create a
ru: создать

source: Explore - %(table)s
ru: Посмотреть - %(table)s

source: Chart [{}] has been saved
ru: Диаграмма [{}] сохранена

source: Chart [{}] has been overwritten
ru: Диаграмма [{}] перезаписана

source: dashboard
ru: дашборд

source: Chart [{}] was added to dashboard [{}]
ru: Диаграмма [{}] была добавлена в дашборд [{}]

source: Dashboard [{}] just got created and chart [{}] was added to it
ru: Дашборд [{}] создан и график [{}] был добавлен к нему

source: This dashboard was changed recently. Please reload dashboard to get latest version.
ru: Этот дашборд был изменен. Пожалуйста, обновите дашборд, чтобы получить последнюю версию.

source: Could not load database driver: %(driver_name)s
ru: Невозможно загрузить драйвер базы данных: %(driver_name)s

source: Invalid connection string, a valid string usually follows: 'DRIVER://USER:PASSWORD@DB-HOST/DATABASE-NAME'
ru: Неверная строка подключения. Верная строка: 'DRIVER://USER:PASSWORD@DB-HOST/DATABASE-NAME'

source: Malformed request. slice_id or table_name and db_name arguments are expected
ru: Некорректный запрос. Ожидаются аргументы slice_id или table_name и db_name

source: Chart %(id)s not found
ru: График %(id)s не найден

source: Table %(table)s wasn't found in the database %(db)s
ru: Таблица %(table)s не найдена в базе данных %(db)s

source: Can't find User '%(name)s', please ask your admin to create one.
ru: Не удалось найти пользователя ‘%(name)s’. Обратитесь к администратору, чтобы создать его.

source: Can't find DruidCluster with cluster_name = '%(name)s'
ru: Не удалось найти DruidCluster с именем cluster_name = ‘%(name)s’

source: Data could not be deserialized. You may want to re-run the query.
ru: Облако данных не может быть десериализованы. Вы можете повторно выполнить запрос.

source: %(validator)s was unable to check your query. Please recheck your query. Exception: %(ex)s
ru: %(validator)s не смог проверить запрос. Ошибка %(ex)s. Перепроверьте запрос.

source: Failed to start remote query on a worker. Tell your administrator to verify the availability of the message queue.
ru: Ошибка запуска запроса. Попросите администратора проверить доступность очереди сообщений.

source: Query record was not created as expected.
ru: Запись запроса не была создана должным образом.

source: There's an error with the parameter %(parameters)s.
ru: Ошибка параметров %(parameters)s.

source: %(user)s's profile
ru: %(user)s профиль

source: Show CSS Template
ru: Показать шаблон CSS

source: Add CSS Template
ru: Добавить шаблон CSS

source: Edit CSS Template
ru: Изменить шаблон CSS

source: Template Name
ru: Имя Шаблона
